{"title":"Cognitive engagement and academic performance of secondary school students on the Flipped Classroom model in distance education","language":"portuguese","abstract":"Cognitive engagement (CE) is a prerequisite for students’ meaningful learning. The present text analyses the student's CE in a proposal based on the Flipped Classroom (FC) model, in distance education (DE). The proposal was implemented through an action-research cycle in Portuguese secondary schools during the Covid-19 pandemic. It combined asynchronous and synchronous lessons divided into teacher-led activities (TLA) and student-centred activities (SCA). To understand the influence of the design of the activities in the student's CE and the impact of the proposal on the students' academic performances, the students' discourses, perceptions, and knowledge assessment tests were analysed. The results showed higher levels of student CE in ACA, as it allowed for a more active role for the students in knowledge construction, greater facilitation from the teacher and peer learning. The results of the students' academic performance were higher in DE than in face-to-face teaching. This may be associated with the CE indicators (positive self-perceptions, self-efficacy, and content understanding) identified in the students' perceptions. However, the same analysis also identified several aspects that need improvement to enhance the FC model in DE.  ","keywords":"Online classroom, Distance Education, Students, Cognitive engagement","authors":[{
	"name":"Teresa Ribeirinha",
        "orcid":"0000-0002-5678-3476",
        "email":"teresaribeirinha@hotmail.com"
        },{
	"name":"Bento Silva Duarte",
        "orcid":"0000-0001-5394-5620",
        "email":"bento@ie.uminho.pt"
        },{
	"name":"Paulo Ribeirinha",
        "orcid":"0000-0003-0191-4317",
        "email":"paribeirinha@fe.up.pt"
        },{
	"name":"Regina Alves",
        "orcid":"0000-0001-7189-5487",
        "email":"rgnalves@gmail.com"
        }],"publication_date":"2022-4-19","field":"Social Sciences","subfield":"Education","sub_subfield":"Educational Technology"}
