{"title":"Instagram, fast food and Historical-Critical Pedagogy: ingredients for the discourse in favor of healthy eating in the context of teaching English","language":"english","abstract":"The purpose of this article is to analyze the discourse of high school students in favor of healthy eating in the context of English language teaching in a public professional education school. Based on Dialogic Discourse Analysis, a corpus composed of 2 posts on Instagram by high school students enrolled in the technical course of Nutrition and Dietetics who produced verbal-visual texts during an action research with English classes inspired by Historical-Critical Pedagogy is explored. The analysis of the posts reveals that the discourse in favor of healthy eating is interrelated with the technical discourse, the everyday discourse, and the discourse about the consequences of fast food consumption. The analysis also shows that the posts have a negative value emphasis in relation to the consumption of fast food, and, through the pamphlet and the informative poster, they denounce the dangers of unhealthy food choices, also seeking to raise awareness among their interlocutors and promote a change in the social practice of these subjects. It is concluded that English classes inspired by Historical-Critical Pedagogy provide students with opportunities to disseminate discourses in a far-reaching social network, expanding their interlocutors, committing themselves to collaborate for a society that is more aware of its eating habits.  ","keywords":"English language teaching, Historical-Critical Pedagogy, Dialogic discourse analysis, Public school, Professional education","authors":[{
	"name":"Elaine Cristina Gomes Aires de Oliveira",
        "orcid":"0000-0002-1022-4687",
        "email":"elaine.cristina.aires@gmail.com"
        },{
	"name":"Samuel de Carvalho Lima",
        "orcid":"0000-0002-7145-3686 ",
        "email":"samuel.lima@ifrn.edu.br"
        }],"publication_date":"2023-7-5","field":"Social Sciences","subfield":"Education Sciences","sub_subfield":"Language Education"}
