{"title":"Learning styles and achievement goals in college students during the COVID-19 pandemic","language":"spanish","abstract":"The purpose of this article is to determine the relationship between learning styles and achievement motivation in students of the Faculty of Health Sciences of the National University of Chimborazo, enrolled during the Covid-19 pandemic period. A cross-sectional, non-experimental, and correlational research with a quantitative approach was developed. 1326 students participated, 1,300 from the Faculty of Health Sciences of the National University of Chimborazo (UNACH), Ecuador and 26 from Education majors from the University of Granada, Spain. Data was collected from the application of the Kolb Model Learning Styles Questionnaire and the Attributional Achievement Motivation Scale. The mean age of the studied population was 20.44 years. The arithmetic means of the scores assigned to the achievement goal factors ranged from 4.25 to 5.34, the last value corresponding to that related to effort. 54.2% of the students showed a divergent learning style. The P values of bilateral significance were from 0.761 to 0.962, showing that there was no correlation between the learning styles and the factors of the investigated achievement goals. The participants whose age ranged between 18 and 28 years were mostly female, most of these ones corresponded to the female gender. Students who assigned a value of 4 or 5 to the factors of the achievement goals studied prevailed. The learning style was dependent on the major and the semester, and the divergent predominated among the participants in five of the seven careers involved. There was no statistical relationship between the learning styles and the factors of the achievement goals investigated.  ","keywords":"learning styles, higher education, achievement goals, COVID-19","authors":[{
	"name":"Yosbanys Roque Herrera",
        "orcid":"0000-0002-7098-3538",
        "email":"yroque@unach.edu.ec"
        },{
	"name":"Manuel Cañas Lucendo",
        "orcid":"0000-0002-6700-6605",
        "email":"mcanas@unach.edu.ec"
        },{
	"name":"Santiago Alonso García",
        "orcid":"0000-0002-9525-709X",
        "email":"salonsog@go.ugr.es"
        },{
	"name":"Carmen Elisa Curay Yaulema",
        "orcid":"0000-0001-5514-646X",
        "email":"carmencuray@unach.edu.ec"
        }],"publication_date":"2021-06-23","field":"Social Sciences","subfield":"Education","sub_subfield":"Educational Psychology"}
