{"title":"University professors: teleworking conditions and use of technologies in the emergency remote teaching framework","language":"spanish","abstract":"The aim of this study is to learn about the experiences of university teachers during and after emergency remote teaching (ERT), which emerged in the context of isolation due to the Covid-19 pandemic. Its methodology has a qualitative, non-experimental, cross-sectional, and descriptive design with a phenomenological approach. As result, the university professors consulted consider that during the ERT, the time dedicated to work increased, both due to meetings outside the timetable and to the creation of educational materials. They express having to use their own resources to teach their subjects online and also detail that there is a lack of technological training. The teachers also commented that they suffered health problems, such as visual weakness, body aches, stress, anxiety and depression. In conclusion, teachers face the situation by updating themselves with information and educational technologies, being flexible and adapting. A limitation of this study is that the sample was obtained with a non-probabilistic method by convenience, in 35 Mexican Institutions of Higher Education (IESM), so it is difficult to generalize these results to all of Mexico.  ","keywords":"Professors, Technostress, Technological training, Information technologies, Universities","authors":[{
	"name":"Angélica Janeth Cortez Soto",
        "orcid":"0000-0002-8540-2417",
        "email":"angelica.janet@gmail.com"
        },{
	"name":"Sara Guadalupe Unda Rojas",
        "orcid":"0000-0002-6113-055X",
        "email":"saraunda@unam.mx"
        },{
	"name":"Pedro Gil-LaOrden",
        "orcid":"0000-0001-7541-4388",
        "email":"pedro.gil-monte@uv.es"
        },{
	"name":"Marlene Rodríguez Martínez",
        "orcid":"0000-0002-9912-8500",
        "email":"psicología.trabajo@hotmail.com"
        },{
	"name":"José Horacio Tovalín Ahumada",
        "orcid":"0000-0003-4419-9392",
        "email":"htovalin@gmail.com"
        }],"publication_date":"2023-5-11","field":"Social Sciences","subfield":"Education","sub_subfield":"Higher Education"}
