{"title":"Browse networks never browsed before: motivations and engagement of the Iberian seniors","language":"portuguese","abstract":"Contemporary western societies are characterized by demographic aging, by the empowerment of senior consumers (aged 65+) and by the popularization of digital technologies, especially the internet and social media. However, scientific knowledge about the relationship between seniors and digital platforms still presents numerous gaps, mainly in the Iberian Peninsula - one of the most aged regions on the planet. This article problematizes this relationship in Portugal and Spain, examining the motives for adherence and use of social media by older people, assessing which brand pages (on Facebook) are most visited and interacted with by seniors, and unveils the role of Facebook fan pages brands in the consumer decision-making process. The research uses a mixed method approach. Qualitative data were obtained from five Focus Group (FG) carried out in the two countries. The quantitative data were extracted from Facebook Audience Insights, from an officially representative sample of seniors in the region. The results show evident signs of a “digital fracture” with the seniors representing only 17.8% (10% PT and 7.8% ES) of the active profiles in the Iberian Peninsula, with a higher presence of women. Portuguese seniors reveal a tendency to like, comment and share content more often than Spaniards. About the reasons for joining and staying in social networking sites, there is a unanimous Iberian stance indicating the encouragement of close family members, as well as in the finding that it is a space that enhances the strengthening and multiplication of social ties. Search and involvement with Facebook brand pages count for support and uncertainty reduction tool in the consumer journey.   ","keywords":"Seniors, Information and communication technologies (ICT), Social media, Facebook, Brand pages, Iberian Peninsula","authors":[{
	"name":"Sandra Miranda",
        "orcid":"0000-0002-5544-5942",
        "email":"smiranda@escs.ipl.pt"
        },{
	"name":"Ana Cristina Antunes",
        "orcid":"0000-0001-8983-2062",
        "email":"aantunes@escs.ipl.pt"
        },{
	"name":"Ana Gama",
        "orcid":"0000-0002-0647-9820",
        "email":"agama@eselx.ipl.pt"
        },{
	"name":"Branco Di Fatima",
        "orcid":"0000-0001-6981-7228",
        "email":"brancodifatima@gmail.com"
        },{
	"name":"Ana Teresa Machado",
        "orcid":"0000-0002-0415-2058",
        "email":"amachado@escs.ipl.pt"
        }],"publication_date":"2021-10-27","field":"Social Sciences","subfield":"Communication and Information Sciences","sub_subfield":"Media Studies"}
