{"title":"Changes in the technological self-perception of teachers in the context of a pandemic","language":"spanish","abstract":"This study relates the changes in the self-perception of teachers in the context of pandemic with the curricular needs suggested by the Chilean Ministry of Education. The objective was to analyze the objectives of the curricular prioritizations and the degree of self-assessment on the integration of technologies of teachers in pre-pandemic and pandemic contexts. The study was analytical, interpretative and comparative. A total of 178 teachers were selected, a TPACK questionnaire was applied to them in December 2020 and January 2021, and four subjects were selected for word clouds based on their prioritized objectives. Results were analyzed descriptively, comparatively with another sample taken in 2018 and among other demographic groups. The results revealed significant differences in several TPACK components (TK, PK, PCK, TCK, and TPK) of teachers. It is concluded that teachers in pandemic context self-perceive themselves with greater technological knowledge, but less pedagogical and content knowledge than teachers in pre-pandemic context, not coinciding with the curricular needs in this period, where greater content and pedagogical management is needed to contextualize learning.  ","keywords":"TPACK, COVID-19, Remote education, Curricular prioritization, Teacher perception","authors":[{
	"name":"Susan Rivera-Robles",
        "orcid":"0000-0001-6086-4992",
        "email":"srivera@ucsc.cl"
        },{
	"name":"Pedro Salcedo-Lagos",
        "orcid":"0000-0002-1741-714X",
        "email":"psalcedo@udec.cl"
        },{
	"name":"Carolina Fernández-Chávez",
        "orcid":"0000-0002-8115-1374",
        "email":"carofernandezc@udec.cl"
        },{
	"name":"María Graciela Badilla-Quintana",
        "orcid":"0000-0002-1317-9228",
        "email":"mgbadilla@ucsc.cl"
        }],"publication_date":"2022-9-03","field":"Education","subfield":"Curriculum and Instruction","sub_subfield":"Technology Integration in Education"}
