{"title":"Playful Service-Learning in initial teacher training: a qualitative study","language":"spanish","abstract":"Higher education is in constant challenge to increase the quality of teaching and the motivation of students. This study evaluates the impact of a Service-Learning program to promote meaningful learning and motivation in initial teacher training. Service-Learning consists of a teaching-learning approach that integrates curriculum content with community service. This research reflects the experience of 31 students of the Early Childhood Education degree in a Service-Learning program where they developed games and didactic materials adapted to the needs of children with learning difficulties in the educational centers of the area. After the completion of the project, a qualitative study was carried out through online surveys to know the opinions and experiences of the students about the methodology. The results indicate that Service-Learning, on the one hand, improves the acquisition of practical learning about attention to diversity and is a methodology that can be motivating, and on the other hand, that when Service-Learning is carried out, university students feel more supportive and consider that their actions can have a positive impact on their environment.  ","keywords":"Service-Learning, Higher education, Innovative education, Learning difficulties","authors":[{
	"name":"Ana Manzano-León",
        "orcid":"0000-0001-6966-0355",
        "email":"aml570@ual.es"
        },{
	"name":"Ana María Ortiz-Colón",
        "orcid":"0000-0003-0440-6107",
        "email":"aortiz@ujaen.es"
        },{
	"name":"Javier Rodríguez-Moreno",
        "orcid":"0000-0002-5890-3654",
        "email":"jmaguilar@ual.es"
        },{
	"name":"José Manuel Aguilar-Parra",
        "orcid":"0000-0002-6703-0680",
        "email":""
        }],"publication_date":"2022-7-5","field":"Education","subfield":"Teacher Training","sub_subfield":"Service-learning in Initial Teacher Training"}
