{"title":"Socioconstructivism, literacy and working with ICTs during the Coronavirus pandemic in 2020","language":"portuguese","abstract":"This paper intends to discuss the positive and negative points of the literacy teaching-learning workmorais2013, morais2014 during the coronavirus pandemic in 2020 from the point of view of a socio-constructivist theoryvygotski1991. Thus, specifically, we intend to discuss how the use of different Information and Communication Technologies (ICTs) impacts on the development of reading and writing in the children's literacy phase, especially which are the roles and actors of this process and how the student's proximal development zone (PDZ) is verified. The results show that a negative point of the exclusive use of ICTs in teaching, both in synchronous and asynchronous activities, is the difficulty in diagnosing the students' level of learning. After all, through face-to-face teaching, it is possible to check the student's progress during the literacy process and, thus, diagnose the development of the PDZ by several ways. A positive point is the valorization of the student's autonomy in the teaching-learning process of reading and writing. As a result, there is also an appreciation of the teacher's mediating role. In addition, family members (parents, grandparents, etc.) who have accompanied this child during remote classes have also started to act, as well as teachers, as mediators in the teaching-learning process.  ","keywords":"Literacy, Remote teaching, Socioconstructivism.","authors":[{
	"name":"Janete Rosa da Fonseca",
        "orcid":"0000-0001-7732-0385",
        "email":"janete.fonseca@ufms.br"
        },{
	"name":"Lovania Roehrig Teixeira",
        "orcid":"0000-0001-9614-8648",
        "email":"lovania.teixeira@ufms.br"
        },{
	"name":"David Arenas Carmona",
        "orcid":"0000-0002-6737-6235",
        "email":"dav.are.car@gmail.com"
        }],"publication_date":"2021-07-2","field":"Social Sciences","subfield":"Education","sub_subfield":"Educational Technology"}
