{"title":"The impact of the state of alarm decreed by COVID-19 on educational inclusion","language":"spanish","abstract":"The state of alarm decreed in most countries, due to Covid-19, forced schools to close. This meant an abrupt change in the way of teaching for which many of the teachers, families and students were unprepared. ITC took on a special role as they became the only way to access education. This situation came at a time when socio-economic differences maintained an open digital divide that prevents us from talking about equal opportunities in education and therefore educational inclusion. The aim of this study was to carry out a literature review in order to determine the consequences that this radical change in teaching has had on the process of educational inclusion, how it has affected the most vulnerable population and teachers, and what it has meant for the so-called digital divide. To this end, access has been gained to the different articles published on this field in the last year in different databases that refer to educational inclusion. The most relevant conclusions were based on the evidence of the importance of closing this digital divide that has left millions of students around the world without access to education and the great progress that has been made, in terms of experience and training of the educational community in general, in ITC and more active and autonomous methodologies for students.  ","keywords":"education, ITC, COVID-19, digital divide, educational inclusion, at risk student","authors":[{
	"name":"María Pilar Cáceres Reche",
        "orcid":"0000-0002-6323-8054",
        "email":"caceres@ugr.es"
        },{
	"name":"José Antonio Marín Marín",
        "orcid":"0000-0001-8623-4796",
        "email":"jmarin@ugr.es"
        },{
	"name":"Magdalena Ramos Navas-Parejo",
        "orcid":"0000-0001-9477-6325",
        "email":"magdalena@ugr.es"
        },{
	"name":"Blanca Berral Ortiz",
        "orcid":"0000-0001-8139-8468",
        "email":"blancaberral@correo.ugr.es"
        }],"publication_date":"","field":"Social Sciences","subfield":"Education","sub_subfield":"Educational Technology and Digital Divide"}
