{"title":"Technological and digital convergence, emergency remote education and ADHD students who attend the final years of elementary school","language":"portuguese","abstract":"This article includes some inclusive educational practices that permeate cyberculture aimed at students with SEN (Special Educational Needs), emphasizing students with ADHD (Attention Deficit Hyperactivity Disorder) who attend the final years of elementary school. The goal is to show some digital resources that can encourage these students to read and write from remote education. By addressing some specificities and contributions of digital literacy in the teaching/learning process and its relationship with a world that is simultaneously experiencing a pandemic caused by COVI-19 and a progressive technological convergence, we conclude that most digital tools and apps were not properly developed for the use of students with ADHD who attend the final years of elementary school. However, we observed that, in the face of adequate intervention, some technological resources can be useful and facilitate the teaching/learning and life of these students. This study will be guided by research conducted by some scholars in the fields of reading and literacy, technology-mediated education, special education and inclusive education such as alexander_2004, antunes_glossario_2001, borgesdalberio_inclusao_2012, coscarelli_letramento_2007, menezes_tecnologias_2019, silva_neto_educacao_2018, rojo_multiletramentos_2012, rojo_generos_2013, amorim_TDAH amorim (2010), as well as scholars who are interested in researching Specific Functional Disorders (TFEs), such as andrade_transtorno_2018, goncalves_inclusao_2019, lopes_inclusao_2011, coscarelliribeiro_2005, rohde_transtorno_1999, pain_diagnostico_1985, among others.    ","keywords":"ADHD, Including education, Digital convergence, COVID-19","authors":[{
	"name":"Sineide Gonçalves",
        "orcid":"0000-0002-4067-5358",
        "email":"sineide.ufmg@gmail.com"
        },{
	"name":"Bárbara Eduarda Barbosa Ferreira",
        "orcid":"0000-0003-1569-9638",
        "email":"pedagogabarbaraa@gmail.com"
        }],"publication_date":"2021-4-29","field":"Social Sciences and Humanities","subfield":"Education","sub_subfield":"Special Education"}
