{"title":"Use of ICT and social networks in the neurodevelopment of minors. Implications for the prevention of the risk of social exclusion","language":"english","abstract":"The presence of technologies in all areas and stages of life increases the risk of addiction to devices, networks, and the use of various programmes. Excessive use of devices and technologies during childhood and adolescence has negative effects on neurodevelopment and causes emotional disorders related to anxiety, stress, and depression. These disorders can be associated with the development of other addictions (alcohol, psychoactive substances) or other situations of risk of social exclusion such as bullying, among others. In our study of the risk of social exclusion in adolescentsavalos2022 we have applied a complete diagnostic battery to 25 subjects of both sexes between 12 and 17 years of age focusing on six dimensions of risk: anxiety and depression, alcohol and other substance abuse, bullying, addiction to technologies, gender violence and risk behaviour in love and sexual relationships, and difficult family situation. The aim of this paper is to present and analyse the correlations found between each of the first three dimensions, and the technology addiction dimension as a predictor of other risk factors for social exclusion. The data show that addiction to video games, in particular, is related to high levels of depression, while addiction to any of the technologies studied (mobile, internet and video games) is significantly related to being a victim of bullying.  ","keywords":"Influence of technology, Neuropsychology, Mental health, Substance Abuse, Bullying","authors":[{
	"name":"Inmaculada Ávalos Ruiz",
        "orcid":"0000-0003-0809-7727",
        "email":"iavalos@ujaen.es"
        },{
	"name":"Mercedes Cuevas López",
        "orcid":"0000-0002-5814-2285",
        "email":"mmcuevas@ugr.es"
        },{
	"name":"Emilio Jesús Lizarte Simón",
        "orcid":"0000-0002-9964-7271",
        "email":"elizarte@ugr.es"
        },{
	"name":"Slava López Rodríguez",
        "orcid":"0000-0002-9360-3518",
        "email":"slavalr@ugr.es"
        }],"publication_date":"2022-9-28","field":"Social Sciences","subfield":"Psychology","sub_subfield":"Developmental Psychology"}
