{"title":"Role of neurodidactics in teacher professionalization for online teaching in higher education","language":"english","abstract":"The objective of this article is to perform a bibliometric analysis that helps to delimit and understand the concepts of Neuroscience and Neurodidactics, taught in higher education, for a better understanding of the different learning processes, that is, to try to explain what, how and why we learn. A quantitative-bibliometric methodology was employed using the Web of Science (WoS) database. The search was performed by filtering 'subject and key terms' in both titles and abstracts of scientific papers using Boolean operators and truncations. We proceeded to work with two samples: the first one without using any kind of filter or refinement of 60 scientific papers; the second one filtering by the thematic categories with a sample of 44 scientific papers.  The years of production, the sources of information, the authors and the keywords of the scientific documents were considered for the analysis of the data. From the results shown through the maps, a total of five research fronts have been inferred as the most relevant and related to the topic: neurodidactics in general; neuroscience and technology; neurodidactics and technological aspects; neuroeducation programs and pedagogy and neurodidactics. As this is a developing field of study, no major specific problems have been found, but for the time being what is obtained is a  broad and general view of this area of research. Future studies that complement or expand this work could be oriented towards conducting replication research.  ","keywords":"Bibliometrics, Neuroscience, Neuroeducation, Neurodidactics, Technology","authors":[{
	"name":"Borja Fernández García-Valdecasas",
        "orcid":"0000-0002-1851-6596",
        "email":"borjagv@correo.ugr.es"
        },{
	"name":"Isabel Martínez Sánchez",
        "orcid":"0000-0003-0802-4878",
        "email":"imsanchez@edu.uned.es"
        },{
	"name":"Daniel González González",
        "orcid":"0000-0001-7311-5819",
        "email":"danielg@ugr.es"
        },{
	"name":"José Álvarez Rodríguez",
        "orcid":"0000-0002-8411-9265",
        "email":"alvarez@ugr.es"
        }],"publication_date":"2022-9-21","field":"Education","subfield":"Education, Research and Development","sub_subfield":"Research Methodology"}
