{"title":"Obsolescence of knowledge vs. training for sustainable development: voices of protagonists in the framework of COVID 19","language":"spanish","abstract":"Throughout history, it has been demonstrated that knowledge has been a precious asset for personal and professional growth and for scientific and social development. In times of crisis, such as COVID 19, these assets reflect an engine for sustainable development. The objective of this article is to provide data on students and graduates who are taking and have taken postgraduate courses in Humanities and Education, in on-site and distance learning environments, to show their motivations, knowledge and the necessary competencies that will enable them to be protagonists and generators of changes in society. The article focused on the application of various instruments to obtain 'the voices' of 454 students and graduates, with questionnaires that showed the motivations and perceptions that the respondents had of the programs. The data showed that there is a need for knowledge that addresses the dynamics of the problems and transformations of the work environment, as well as the development of competencies related to research, innovation and technologies. It is concluded that, in training, it is essential to have a constant link with various sectors of society, in a multidisciplinary, interinstitutional and supportive work. This study may be of value to teachers, researchers, designers, entrepreneurs, technologists, managers and decision-makers interested in promoting training environments that support the sustainable development of scientific, technological and innovation capabilities which enable an impact on social transformation.  ","keywords":"Knowledge, Educational innovation, Technologies, Higher education, COVID 19","authors":[{
	"name":"Maria Soledad Ramírez-Montoya",
        "orcid":"0000-0002-1274-706X",
        "email":"solramirez@tec.mx"
        }],"publication_date":"","field":"Social Sciences","subfield":"Education","sub_subfield":"Higher Education"}
