{"title":"Teachers' perception of web games and mobile devices at the higher educational level during the COVID-19 pandemic","language":"spanish","abstract":"The SARS-CoV-2 virus has caused universities to search for new technological alternatives in order to improve the teaching and learning in distance modality. This quantitative and qualitative research analyzes the perception of educators about web games and mobile devices during the COVID-19 pandemic considering the machine learning technique and decision tree technique (data science). The participants are 60 teachers of higher education who taught courses at the National Autonomous University of Mexico in 2021 and took the “Innovation in University Teaching 2021” Diploma. The machine learning technique indicates that the use of web games and mobile devices positively influences the teaching work and participation of the students during the teaching-learning process. In addition, data science establishes 4 predictive models about these technological tools through the decision tree technique. Finally, web games and mobile devices allow the creation of new virtual spaces that favor distance teaching and facilitate learning from anywhere.  ","keywords":"Educators, Mobile devices, ICT, Teaching, Data science","authors":[{
	"name":"Ricardo-Adán Salas-Rueda",
        "orcid":"0000-0002-4188-4610",
        "email":"ricardo.salas@icat.unam.mx"
        },{
	"name":"Jesús Ramírez-Ortega",
        "orcid":"0000-0002-4538-9203",
        "email":"jesus.ramirez@icat.unam.mx"
        },{
	"name":"Ana-Libia Eslava-Cervantes",
        "orcid":"0000-0002-7420-3412",
        "email":"libia.eslava@icat.unam.mx"
        },{
	"name":"Ricardo Castañeda-Martínez",
        "orcid":"0000-0002-2225-7136",
        "email":"ricardo.castaneda@icat.unam.mx"
        },{
	"name":"Gustavo De-La-Cruz-Martínez",
        "orcid":"0000-0002-4446-7396",
        "email":"gustavo.delacruz@icat.unam.mx"
        }],"publication_date":"","field":"Education and Educational Research","subfield":"Higher Education","sub_subfield":"Educational Technology"}
