{"title":"Neurodidactic factors in the prediction of academic dropout in Andalusian university students: preventive actions based on ICT","language":"english","abstract":"Persistence and dropout are two sides of the same coin. Together with personal and social factors, associated with the quality of teaching provided by universities determine students' ability to persist in achieving their academic degree or, on the contrary, to drop out of university studies. Our working hypothesis is that the impact on improving the quality of teaching by considering neurodidactic factors, which are currently being researched and experimented with, can improve the overall persistence rate by reducing the dropout rate. In this preliminary study, we intend to make a first approach to the phenomenon of academic failure in Andalusian universities from the prediction and diagnosis of risk groups and the recommendation of preventive measures. Among the measures we proposed for prevention, we highligh those that have an impact on neurodidactic factors. Our work consisted of applying an instrument to diagnose the risk of dropping out of university studies to a sample of first-year university students in Andalusian universities. The instrument was applied at the beginning of the second semester. Out of the 976 students surveyed, we have established a risk group of 34 students. We will propose measures oriented towards the neurodidactics factors that predict dropout and call for the use of ICT in the implementation of preventive measures.  ","keywords":"Neuroscience, Student dropout, ICT, Preventive actions, Neurodidactics","authors":[{
	"name":"Daniel Álvarez Ferrándiz",
        "orcid":"0000-0003-4924-1334",
        "email":"dalferrandiz@ugr.es"
        },{
	"name":"María Arias Corona",
        "orcid":"0000-0002-6290-5636",
        "email":"mawi46@gmail.com"
        },{
	"name":"Esther González Castellón",
        "orcid":"0000-0002-8129-5693",
        "email":"esthergonzalez@ugr.es"
        },{
	"name":"Manuel Fernández Cruz",
        "orcid":"0000-0002-6873-7186",
        "email":"manuelfernandezcruz@ugr.es"
        }],"publication_date":"2022-9-29","field":"Social Sciences","subfield":"Education","sub_subfield":"Higher Education"}
