{"title":"Representation of structured data of the text genre as a technique for automatic text processing","language":"english","abstract":"The present article was developed in the field of Natural Language Processing and Language Studies based on a corpus compiled by computational tools. This study is based on the assumption that it is helpful to trace a close relationship between corpus generation/annotation and the assessment of the constitutive elements of the text genre source. It aims to demonstrate, through specific studies of structured data from the text genre ‘scientific article’, alternatives to automatic text processing techniques. In order to reach the intended goal, the authors created a computational model for the compilation of a linguistic, specialized Corpus, representative of the genre Scientific Article - CorpACE. The object of study includes the constitutive elements of scientific articles, marked in XML, extracted and collected from the SciELO-Scientific Electronic Library On-line database. The final product was a database obtained with information extracted and structured in XML format, which designates and identifies the markups of the genre being analyzed and is available for many tools and applications. The results demonstrate how the representation of constitutive elements of the genre can condense available information with hierarchical and dynamic processes built during the compilation. At the end of the study, it is believed that more research will be required for bringing Language Science and Computer Science closer with emphasis on NLP in the attempt to represent and manipulate linguistic knowledge in its many levels – morphological, syntactic, semantic and discursive – in order to improve implementation and manipulation of automatic text processing.  ","keywords":"\textit{Corpus} linguistics, Natural language processing, Scientific article, Text genre, \textit{Corpora} annotation","authors":[{
	"name":"Claudia Aparecida Fonseca",
        "orcid":"0000-0003-1945-0872",
        "email":"claudia.fonseca@ufvjm.edu.br"
        },{
	"name":"Marcus Vinícius Carvalho Guelpeli",
        "orcid":"0000-0001-5724-1081",
        "email":"marcus.guelpeli@ufvjm.edu.br"
        },{
	"name":"Rafael Santiago de Souza Netto",
        "orcid":"0000-0003-1231-5387",
        "email":"rafael.santiago@tutanota.com"
        }],"publication_date":"2022-1-27","field":"Linguistics","subfield":"Natural Language Processing","sub_subfield":"Computational Linguistics"}
