{"title":"Pandemic masks: a review systematics on the impacts of the mask on recognition of emotions","language":"portuguese","abstract":"The use of pandemic masks is one of the main behavioral changes brought about by the COVID-19 pandemic, which has possibly hampered the Facial Emotion Recognition (FER). This systematic review aims to gather and compare methodologies and results of experiments, published between 2019 and 2022, that assess the impact of pandemic masks on FER. Therefore, this study has been based and divided on the PRISMA recommendations, in three stages: identification, screening, and eligibility. The first step was dedicated to the choice of descriptors, the time frame and their application in the chosen databases. In the second step, titles, abstracts, and keywords were read to select articles that meet the inclusion criteria. The articles selected at this stage were placed on the Connected Papers platform, in order to explore unidentified references via databases. In the last phase, the full reading and the synthesis of the studies were carried out. Finally, 11 articles have been elected, whose results showed that pandemic masks harm the FER in a heterogeneous way. Expressions such as happiness and disgust, which depend on the region of the mouth to be discriminated, are harmed. Sadness is also undermined by pandemic masks, often getting confused with neutral faces and vice versa. For the findings to be more generalizable, future studies need to adopt standardized tasks with all basic expressions and include non-basic expressions such as shame. In addition, the implementation of dynamic stimuli with ethnic variation and control over exposure time are recommended.  ","keywords":"Mask, Emotion, Recognition, Experiment","authors":[{
	"name":"Thiago Dantas",
        "orcid":"0000-0002-9530-8707",
        "email":"thiagodantas474@gmail.com"
        },{
	"name":"Julian Tejada",
        "orcid":"0000-0003-0275-3578",
        "email":"julian.tejada@gmail.com"
        },{
	"name":"Raquel Meister Ko. Freitag",
        "orcid":"0000-0002-4972-4320",
        "email":"rkofreitag@academico.ufs.br"
        }],"publication_date":"2023-2-27","field":"Social Sciences","subfield":"Psychology","sub_subfield":"Cognitive Psychology"}
