{"title":"Mathematics and Physics in Free Robotics experiments: exploring the ultrasonic sensor","language":"portuguese","abstract":"In this article, we approach Mathematics and Physics learning through Educational Robotics in a free perspective, with the use of free materials, so that students could build up their knowledge from the idea of Constructionism, aligned with the Creative Learning Spiral. The construction of this manuscript was possible with/through a field research, with a qualitative case study, applied in a 9th grade class of a public school in the state of Goiás, Brazil, during the second semester of 2019, in which the Arduino platform and free hardware parts are used. Through the development of robots, with assembly sequences, it was possible to imagine, create, play, share and reflect, permeating the construction of the Creative Learning Spiral. From this perspective, the “ground” is prepared for the learning of Mathematics, Physics, Engineering, Technologies, Art and Sciences, embedded in the robot development process. With the sequences developed here in this article, it was possible for students to learn concepts and skills, such as: ultrasonic waves, average speed, conversion of measurement units, functions and numerical intervals. As a result, it is possible to emphasize the importance of studying Mathematics and Science, aligned with the use of free technologies, shortening the distance between curricular knowledge and sustainable technological development.  ","keywords":"Free Educational Robotics, Creative learning, Constructionism, Ultrasonic waves with free robotics, Arduino in Basic Education","authors":[{
	"name":"Marcelo Pires da Silva",
        "orcid":"0000-0002-5574-1055",
        "email":"marte032@gmail.com"
        },{
	"name":"Fernando da Costa Barbosa",
        "orcid":"0000-0001-8558-3521",
        "email":"fcbarbosa@ufg.br"
        }],"publication_date":"2021-8-24","field":"Natural Sciences","subfield":"Mathematics and Physics","sub_subfield":"Educational Robotics"}
