{"title":"Digital natives and immigrants in the context of COVID-19: the contradictions of a diversity of myths","language":"spanish","abstract":"In the context of COVID-19 different changes and tensions have occurred in the Education System as a result of several factors. The rapid and strong transition towards a distance learning system mainly based on technology has brought to the surface weaknesses in the Education System derived from teacher training, the lack of technology, the lack of educational resources to be used in virtual distance learning and the lack of credibility regarding the effectiveness of this training modality. This article highlights the lack of differences in technological proficiency between so-called digital 'natives' and 'immigrants', between students and teachers. In general, it is problematic to assume that students are digitally competent, while teachers have not developed such proficiency. This has led to negative consequences that, in turn, caused educational institutions to neglect the training of students in digital competencies. Mere exposure to technology should not be confused with having a high capacity to use it. It concludes by defending the term digital learners, rather than digital natives. Thus, it is argued that digital literacy is not only about handling technological tools, but also thinking and problem-solving in a digital society.  ","keywords":"Educational technology, Teacher training, Digital competence","authors":[{
	"name":"Julio Cabero-Almenara",
        "orcid":"0000-0002-1133-6031",
        "email":"cabero@us.es"
        },{
	"name":"Rubicelia Valencia-Ortiz",
        "orcid":"0000-0003-4656-5456",
        "email":"rubicelia.valencia@macmillaneducation.com"
        },{
	"name":"Carmen Llorente-Cejudo",
        "orcid":"0000-0002-4281-928X",
        "email":"karen@us.es"
        },{
	"name":"Antonio de Padua Palacios-Rodríguez ",
        "orcid":"0000-0002-0689-6317",
        "email":"aprodriguez@us.es"
        }],"publication_date":"2023-1-27","field":"Social and Behavioral Sciences","subfield":"Education Sciences","sub_subfield":"Technology-Enhanced Learning"}
