{"title":"Engagement in virtual education: experiences during the COVID-19 pandemic","language":"spanish","abstract":"Virtual courses are educational alternatives that contribute to the permanent training of professionals. Achieving adequate engagement allows raising motivation, commitment, responsibility, and positive emotions towards the achievement of learning objectives and goals. Due to the current confinement conditions caused by the Covid-19 pandemic, it is essential to achieve, as much as possible, an engagement in the virtual courses. The objective of this study is to determine if the redesign of the virtual course 'Introduction to the evaluation of the usability of computer systems', offered at the Universidad de las Ciencias Informáticas, favors higher levels of engagement in the current confinement conditions. A quasi-experiment was designed with a control group and an experimental group. Statistical tests confirm higher levels of engagement within the subjects of the experimental group. It is concluded based on the educational experiences obtained that the characteristics that should be promoted in the virtual courses offered in the current time of the pandemic are (1) applied engagement factor: design of digital educational resources and relevant materials for professional life and application of what has been learned; (2) Goal-oriented engagement factor: integration between the organizational psychological climate and professional motivation, and collaborative activities; and (3) Self-disciplined engagement factor and interactive engagement: challenging learning content, synchronous and asynchronous activities, and interactive sessions through Telegram.  ","keywords":"Quasi-experiment, Virtual courses, Covid-19, Engagement, Educational Technology","authors":[{
	"name":"Odiel Estrada Molina",
        "orcid":"0000-0002-0918-418X",
        "email":"oestrada@uci.cu"
        },{
	"name":"Dieter Reynaldo Fuentes Cancell",
        "orcid":"0000-0002-2509-5400",
        "email":"dieterr@uci.cu"
        },{
	"name":"Alién García Hernández",
        "orcid":"0000-0002-9701-9351",
        "email":"agarciahh@uci.cu"
        }],"publication_date":"2021-06-28","field":"Social Sciences","subfield":"Education","sub_subfield":"Online education"}
