{"title":"Technology and abstraction: complex skills development through video games","language":"spanish","abstract":"This study aims to propose supervised machine learning models to predict the abstraction ability in students as an early warning mechanism through both the technology use and the video game use. The methodology used was mixed with a prescriptive and predictive design; 118 tests were carried out by Chilean pedagogy students. For analysis, several variables were correlated: age, modality, academic semester and six predictive models. The results show three relevant findings; First, regarding the relation abstraction/ age, in the Satisfactory and No abstraction, the distribution is homogeneous in every age. Second, the relationship abstraction/modality shows a 50% pattern for all the abstraction categories. Third, the relation abstraction/academic semester shows that most students from the seventh semester have no capacity for abstraction. The study concludes the abstraction level is low, showing that 61,1% of the students do not have a higher cognitive level. Two out of six of the supervised machine learning models are suggested to predict early warning, decision tree and random forest since they have a 100% accuracy. Therefore, through the use of technology and the video game it is possible to ensure higher cognitive level development, by the use of several planned strategies in covid-19 times concentrated in the first two tears of pedagogy training.  ","keywords":"higher thinking, cognitive skill, abstraction, play games, projective models, technology","authors":[{
	"name":"Andrea del Carmen Figueroa Vargas",
        "orcid":"0000-0002-6285-4373",
        "email":"afigueroav@udla.cl"
        },{
	"name":"Margarita Ercilia Aravena Gaete",
        "orcid":"0000-0003-3198-8384",
        "email":"margarita.aravena.gaete@ed.udla.cl"
        },{
	"name":"María Natalia Campos Soto",
        "orcid":"0000-0002-3361-2930",
        "email":"ncampos@ugr.es"
        },{
	"name":"David Ruete Zuñiga",
        "orcid":"0000-0002-7100-9737",
        "email":"druete@unab.cl"
        }],"publication_date":"","field":"Education Sciences","subfield":"Pedagogy","sub_subfield":"Cognitive Development"}
