{"title":"Personalized and adaptive learning: educational practice and technological impact","language":"english","abstract":"Education Technology advances many aspects of learning. More and more learning is taking place online. Learners’ learning behaviors, style, and performance can be easily profiled through learning analytics which collects their online learning footage. It enables and encourages educational research, learning software application development, and online education practices towards personalized and adaptive learning. As we continue to see personalized and adaptive learning progress, we must also pay attention to the negative impacts that feed into our research. In this paper, we present our introspection of personalized and adaptive learning and argue that it is the social and moral responsibility of educators and institutions to apply personalized and adaptive learning wisely in their education practice. Educators and institutions should also recognize the realistic diversities of individual students’ learning styles and variable learning progress, contextually dependent learning accessibility, and their correspondent support needs for the fine-grained learning activities. We argue that strategically balanced practices and innovated learning technology are crucial towards an optimized learning experience for the learners.  ","keywords":"Personalized learning, Adaptive learning, Learning barriers, Social responsibility","authors":[{
	"name":"Rebeca Soler Costa",
        "orcid":"0000-0003-2033-9792",
        "email":"rsoler@unizar.es"
        },{
	"name":"Qing Tan",
        "orcid":"0000-0002-6447-2133",
        "email":"qingt@athabascau.ca"
        },{
	"name":"Frédérique Pivot",
        "orcid":"0000-0002-0480-9937",
        "email":"fpivot@athabascau.ca"
        },{
	"name":"Xiaokun Zhang",
        "orcid":"0000-0002-0985-6767",
        "email":"xiaokunz@athabascau.ca"
        },{
	"name":"Harris Wang",
        "orcid":"0000-0002-0988-9497",
        "email":"harrisw@athabascau.ca"
        }],"publication_date":"","field":"Education","subfield":"Education Technology","sub_subfield":"Personalized and Adaptive Learning"}
