{"title":"Influence of the application of a reading plan on motivation, emotional intelligence, fluency and reading comprehension in Spanish primary school students","language":"english","abstract":"Reading is positioned as an important skill in people's daily lives. That is why work is done and time is dedicated to its development in educational centers through didactic proposals that are compiled in the Reading Plan. This research focuses on knowing the impact of the Reading Plan on various dimensions such as motivation, emotional intelligence, fluency and reading comprehension in primary school students from different educational centers in Spain. For this, a quantitative methodology has been followed with a pre-post quasi-experimental design with a control and an experimental group. 331 students enrolled between 5 and 6 grade of said educational stage participated in the study. The data has been collected through many validated instruments (Questionnaire of Motivated Strategies for Learning, BarOn Emotional Intelligence Inventory and the EMLE-TALE 2000) for the objectives pursued. After the statistical analysis, the results obtained reveal how the increase in emotional intelligence of the experimental group has improved the students’ motivation, both intrinsically and extrinsically, and this has favoured the acquisition of greater fluency and reading comprehension concerning the control group. It is concluded that motivation, emotional intelligence, fluency and reading comprehension are higher in experimental group than those achieved by students in the control group. This shows that the Reading Plan developed by the experimental group positively impacts the improvement of these dimensions in the students.  ","keywords":"Reading comprehension, Reading fluency, Motivation, Emotional intelligence","authors":[{
	"name":"José-Antonio Marín-Marín",
        "orcid":"0000-0001-8623-4796",
        "email":"jmarin@ugr.es"
        },{
	"name":"Jesús López-Belmonte",
        "orcid":"0000-0003-0823-3370",
        "email":""
        },{
	"name":"Georgios Lampropoulos",
        "orcid":"0000-0002-5719-2125",
        "email":""
        },{
	"name":"Antonio-José Moreno-Guerrero",
        "orcid":"0000-0003-3191-2048",
        "email":""
        }],"publication_date":"2023-1-31","field":"Education","subfield":"Language and Literacy Education","sub_subfield":"Reading Instruction and Reading Comprehension"}
