{"title":"Teaching Russian as a foreign language during the COVID-19 pandemic","language":"english","abstract":"Foreigners coming to the Russian Federation must learn Russian as a foreign language to be able to enter professional programs at Russian higher education institutions. Unfortunately, many foreign students entering medical faculties often lack the required academic level of proficiency in Russian. For this purpose, Russian higher education institutions develop online courses and introduce additional digital resources into the educational process. The need for high-quality educational content has escalated by the COVID-19 pandemic. That is why the Peoples’ Friendship University of Russia invites foreign students in biomedical pre-university programs to take an online course in the scientific style of the Russian language from the elementary level to B1. The objective of this study was twofold: first, we attempted to examine how the students’ attitude towards Russian as a foreign language, motivational sphere, and performance change as they take the course; next, we examined the level of satisfaction of foreigners with such courses in two years - in 2018, during the pre-pandemic period, and in 2021, when the COVID-19 pandemic had a clear impact on the extensive use of distance learning. For this purpose, we used modified questionnaires by orlov_kolmogorov_2014, and created a questionnaire all foreign students were asked to answer upon completing the courses. The study showed that foreign students of the biomedical profile who study at preparatory faculties on the proposed courses in 2018 and 2021 exhibited significant differences in the motivational sphere, the nature of their attitude towards the applied online courses. These findings allow us to conclude that the applied online courses are a valid supplemental form of training that can be used during any situation that causes in-person instruction to be impractical and can be used as material for independent work within the traditional classroom teaching system.  ","keywords":"Language of the major, Online learning, Covid-19 pandemic, Foreign learners, Russian as a second language","authors":[{
	"name":"Olga Fisenko",
        "orcid":"0000-0002-3824-5535",
        "email":"olfiss@list.ru"
        },{
	"name":"Zozulya Elena Alexandrovna",
        "orcid":"0000-0002-8601-8409",
        "email":"zozulya.eag@bk.ru"
        },{
	"name":"Nikitina Vlada",
        "orcid":"0000-0003-0780-3140",
        "email":"nikitina-vlada@internet.ru"
        },{
	"name":"Bystrenina Irina Evgenevna",
        "orcid":"0000-0001-5424-691X",
        "email":"iesh@rambler.ru"
        }],"publication_date":"2022-8-9","field":"Linguistics","subfield":"Language Education and Applied Linguistics","sub_subfield":"Teaching Russian As A Foreign Language"}
