{"title":"Management and academic anxiety in Ibero-American higher institutions students during COVID-19","language":"english","abstract":"The COVID-19 pandemic has caused uncertainty and instability in the population regarding the capacity of institutions to manage and mitigate its impact. In such an emergency, it is possible to ask how higher education institutions have dealt with this situation and what elements of institutional management have had the most significant influence in controlling stress and academic anxiety. The study aims to measure the level of academic anxiety among university students in Ibero-America since March 2020 due to the COVID-19 pandemic. It also seeks to identify the associated variables; some linked to the digital sphere, which affect the perception of the evaluation made by these students of the institutional management carried out by higher education institutions in Ibero-America. This article provides the quantitative research results that collected data using an anonymous online survey conducted from April 6 to April 24, 2020, in some higher education universities in Ibero-America, including 523 students surveyed. The data analysis is based only on the survey respondents' answers registered in institutions in six Ibero-American countries. The results identify psycho-social variables associated with the level of academic anxiety students perceive. They also point to the need for higher education institutions in Ibero-America to review their management models to guarantee their educational communities (e.g., students). This support consists of reinforcing soft skills that increase the capacity to transform the educational model.  ","keywords":"Higher education, Management, Students, Anxiety, COVID-19","authors":[{
	"name":"Elias Said-Hung",
        "orcid":"0000-0002-0594-5906",
        "email":"elias.said@unir.net"
        },{
	"name":"Eva Matarín Rodríguez-Peral",
        "orcid":"0000-0002-1701-3911",
        "email":"eva.matarin@urjc.es"
        },{
	"name":"Carolina Mejía Corredor",
        "orcid":"0000-0002-3560-5443",
        "email":"cmejiaco@universidadean.edu.co"
        }],"publication_date":"","field":"Social Sciences","subfield":"Education","sub_subfield":"Higher education management"}
