{"title":"What are the factors that influence the use of social networks as a means to serve pedagogy?","language":"english","abstract":"Social networks are a key element in young people's and teenagers' leisure time. But their influence goes beyond the field of entertainment further reaching educational and training environments. These tools can support and improve student learning, but it is clear that they can also be an inconvenience or a potential danger for the youth. The purpose of this research is to describe the profiles of teachers who use social networks as resources for their teaching, both inside and outside the classroom. It also seeks to know the characteristics that influence their incorporation as learning elements. For this reason, a secondary exploitation of the PISA 2018 database is carried out. It contains the data of 21,621 teachers of the secondary education level from the 19 regions of Spain. Multilevel analysis is used as a method of data analysis. The results point out differences in use according to the Autonomous Communities, showing the importance of the age of the teacher and the number of years of experience, both for their use in the classroom and to cover their training needs. Quality teaching requires a commitment to technological resources; therefore, decisive to know these elements in order to design teachers and educational institutions.  ","keywords":"Social networks, Teacher education, Multimedia instruction, Information technology","authors":[{
	"name":"Melchor Gómez-García",
        "orcid":"0000-0003-3453-218X",
        "email":"melchor.gomez@uam.es"
        },{
	"name":"Moussa Boumadan",
        "orcid":"0000-0003-3334-1007",
        "email":"moussa.boumadan@uam.es"
        },{
	"name":"Roberto Soto-Varela",
        "orcid":"0000-0003-2105-5580",
        "email":"rsoto@nebrija.es"
        },{
	"name":"Ángeles Gutiérrez-García",
        "orcid":"0000-0001-7376-6064",
        "email":"nines.gutierrez@uam.es"
        }],"publication_date":"2020-12-22","field":"Education and Pedagogy","subfield":"Education","sub_subfield":"Technology-enhanced Learning"}
