{"title":"Use of Machine Learning algorithms to analyze Moodle and smartphones in the educational process of Physics","language":"spanish","abstract":"The aim of this mixed study is to analyze the students' perceptions on the use of Moodle and smartphones in the educational process about Physics through Data Science. The algorithms of Machine Learning used are linear regression, decision tree and deep learning. In this research, the incorporation of Moodle facilitated the delivery of tasks, consultation of contents, communication and review of multimedia resources. Likewise, smartphones allowed the access to virtual learning platforms, use of mobile applications and communication from anywhere. The results of the linear regression and deep learning algorithms establish that the use of Moodle and smartphones positively influence the motivation of the students, assimilation of knowledge and satisfaction in the Physics course. On the other hand, the decision tree algorithm determines six predictive models. The limitations are the Machine Learning techniques used and the analysis of technological tools for the assimilation of knowledge, motivation and satisfaction. Future studies may look at the use of Moodle and smartphones for active role and skill development in various high schools and universities. Similarly, Machine Learning algorithms on random forests and logistic regression can be used to examine the impact of these technological tools considering academic performance. Finally, the incorporation of Moodle and smartphones allows updating the courses and designing creative distance activities.  ","keywords":"Moodle, Smartphones, Machine learning, Deep learning, Education","authors":[{
	"name":"Ricardo-Adán Salas-Rueda",
        "orcid":"0000-0002-4188-4610",
        "email":"ricardo.salas@icat.unam.mx"
        },{
	"name":"Jesús Ramírez-Ortega",
        "orcid":"0000-0002-4538-9203",
        "email":"jesus.ramirez@icat.unam.mx"
        },{
	"name":"Selene-Marisol Martínez-Ramírez",
        "orcid":"0000-0002-5655-0963",
        "email":"selene.martinez@icat.unam.mx"
        },{
	"name":"Clara Alvarado-Zamorano",
        "orcid":"0000-0001-9122-7590",
        "email":"clara.alvarado@icat.unam.mx"
        }],"publication_date":"2023-1-18","field":"Computer Science","subfield":"Artificial Intelligence","sub_subfield":"Machine Learning"}
