{"title":"Effects of pre-editing operations on audiovisual translation using TRADOS: an experimental analysis of Saudi students’ translations","language":"english","abstract":"Neural Machine Translation (NMT) is a revolutionary innovation that has had a significant impact not only on the translation industry but also on translation studies. This technology is creating new opportunities for shaping identities and generating new knowledge and perspectives. This led researchers to undeniably and increasingly conduct studies to improve NMT performance. These studies involve assessing the quality of the output, determining the extent to which humans can be involved in the machine-based process, and proposing solutions to redress the deficiencies. In this regard, the paper focuses on the impact of pre-editing (PE) operations on the translation of audiovisual children’s literary texts (subtitles) from English to Arabic using TRADOS. The work seeks to accomplish a number of pre-editing-related research goals in the context of Arabic NMT systems. Initially, it aims to define and clarify the idea of PE and its function in enhancing Arabic NMT systems' performance. Second, it looks at PE mechanisms and methods and how they might improve the appropriateness and accuracy of Arabic machine translation. Additionally, the study attempts to investigate the value of PE in enhancing the Arabic translation of audiovisual children's literature. The study also seeks to list the difficulties and restrictions related to PE and suggest viable strategies to get over them. Finally, the paper offers suggestions for further investigation into NMT systems using Arabic and PE. To achieve these goals, the researchers conducted a human evaluation of NMT for two animated movie subtitles and determined the necessary PE operations. The findings revealed that PE has the potential to improve the quality of literary translations and enhance their comprehensibility and acceptability.  ","keywords":"Pre-editing, NMT systems, TRADOS, Literary translation, Audiovisual translation","authors":[{
	"name":"Chaouki Bounaas",
        "orcid":"0000-0003-1006-1360",
        "email":"chaouki.bounaas@univ-msila.dz"
        },{
	"name":"Bahia Zemni",
        "orcid":"0000-0002-6238-7509",
        "email":"baalzemni@pnu.edu.sa"
        },{
	"name":"Fadiah Al Shehri",
        "orcid":"0000-0001-7679-8248",
        "email":"fadiah2425@gmail.com"
        },{
	"name":"Mimouna Zitouni",
        "orcid":"0000-0002-4167-3602",
        "email":"MBZitouni@pnu.edu.sa"
        }],"publication_date":"2023-7-21","field":"Language and Linguistics","subfield":"Translation Studies","sub_subfield":"Neural Machine Translation and Pre-editing"}
