{"title":"Democratic management in the Institutional Development Plan of the Federal Institutes: an analysis based on the use of the IRaMuTeQ software","language":"portuguese","abstract":"This paper aims to present an innovative methodology in qualitative research used in a postgraduate  investigation in Professional and Technological Education. The appropriation of the term 'democratic management' was identified in Institutional Development Plans (IDP) of the Federal Institutes of the Federal Network of Vocational, Scientific and Technological Education in Brazil. It  is based on two premises: the first one assumes that in an institution created 20 years after the 1988 Federal Constitution, the concept of 'democratic management' is exercised in its entirety and is present in its main institutional planning document; the second states that the concept brings semantics directly related to the political and pedagogical dimension of school management, reinforcing the tripod teaching, research and extension. This is a result of the proposal of an educational institution committed to  educating for citizenship and to the world of work. For this analysis, the IRaMuTeQ software was used as a support tool in text analysis. We also evaluated the usability of the tool for this task. This study analyzed the IDPs of 38 Federal Institutes, published between 2014 and 2020 on their respective institutional websites. From the techniques of Descending Hierarchical Classification (CHD), Analysis of Similarity, Correspondence Factor Analysis (AFC), we sought to understand how the concept of democratic management is materialized and what the lexical connections are established in the documents. It was concluded that the IDP are important documents and reflect the institution's understanding of the concept of democratic management. The assumptions proved to be partially true. When their lexical connections were analyzed, the concept of democratic management was presented in an incipient way or even disconnected from other concepts that were expected to dialogue. This result encourages new analyses to better understand the phenomenon. This study also confirmed the potential of using the technical resources of IRaMuTeQ as a methodological tool in qualitative research.   ","keywords":"Democratic management, IRaMuTeQ, Federal Institute","authors":[{
	"name":"Silvani da Silva~",
        "orcid":"0000-0003-2207-6965",
        "email":"silvani.silva@ifc.edu.br"
        },{
	"name":"Eduardo Augusto Werneck Ribeiro~",
        "orcid":"0000-0003-3313-6783",
        "email":"eduardo.ribeiro@ifc.edu.br"
        }],"publication_date":"","field":"Social Sciences","subfield":"Education Sciences","sub_subfield":"Professional and Technological Education"}
