{"title":"The issue of organ donation on Facebook: analysis of the Ecuadorian INDOT fanpage","language":"spanish","abstract":"This article analyzes the interactions on the Facebook fanpage of the National Institute of Donation and Transplantation of Organs, Tissues and Cells (Indot) of Ecuador, to observe the donation as an object of dialogue in sectors of the Ecuadorian citizenship. Two analyzes were chosen: first, the use of fanpage metrics such as followers, reactions, shares and others; and second, a lexicometric analysis applied to the texts of publications, comments, and image descriptions. The Reinert Analysis was executed with Iramuteq (R´s interface) as a precategorization mechanism and later interpreted by the researchers. Both analyzes were applied to a data matrix created manually between 2012 and June 2020. The results showed that the fanpage has an acceptable visibility for the Ecuadorian population and a good evaluation; on the other hand, a meaningful dialogue is not reflected, which corresponds to a previous Twitter experience that showed that organ donation in Ecuador has zero visibility, even when every citizen is a donor by law unless otherwise indicated. Reinert's analysis revealed donation awareness, emphasis on the Institute's mission, and successful transplant cases as main categories, the last one generating more dialogue reflected in supportive comments and requests for help. There is evidence of the wide potential of this space as a disseminator of donations - which corresponds to experiences in other countries - and of accountability.   ","keywords":"Organ donation, Facebook, INDOT, Ecuador, Iramuteq","authors":[{
	"name":"Gabriel Francisco Cevallos Martínez",
        "orcid":"0000-0002-3115-1544",
        "email":"gabriel.cevallos@iaen.edu.ec"
        },{
	"name":"Jonathan Bladimir Zhiminaicela Cabrera",
        "orcid":"0000-0001-9462-9608",
        "email":"Jzhiminai1@utmachala.edu.ec"
        },{
	"name":"María Fernanda Fernández Gonzales",
        "orcid":"0000-0001-5220-0029",
        "email":"mfernandezg@est.ups.edu.ec"
        },{
	"name":"Sueny Paloma dos Santos",
        "orcid":"0000-0002-8424-893X",
        "email":"Slima957@puce.edu.ec"
        }],"publication_date":"2021-7-30","field":"Computer Science","subfield":"Information Systems","sub_subfield":"Social Media Analysis"}
