{"title":"Artificial intelligence in education: the challenges of ChatGPT","language":"portuguese","abstract":"To discuss the impacts of the diffusion of access to language model platforms in education, this study points to methodological and substantive issues around generative Artificial Intelligence (AI) for the field of digital humanities, which has concerned educators, mainly in Higher Education, in situations such as plagiarism, critical development and creativity in contemporary textuality. Thus, the study aims to reflect, based on Andrew Feenberg's Critical Theory of Technology, how AI can be enhanced in the face of the common aversive embarrassment that requires changes. Methodologically, the research is of a qualitative, exploratory nature and the study takes advantage of a bibliographical research, whose inherent contributions to the conception of AI are based on the productions of 2022kaufman and santaella2021humanos, santaella2023inteligencia, which serve as a premise for to relate AI problematizations with feenberg2003, feenberg2004 Critical Theory of Technology. Data point to two aspects: the first one that places generative AI as an event to be inhibited by educational institutions, due to the lack of ethical regulations; and the other that suggests to enhance the use of these products with a critical purpose, in the perspective of increased intelligence. In short, the study points out that generative AI is a field that lacks regulations, but that can be conducted collectively, mainly within Higher Education Institutions, which have the potential to discuss these issues critically and with the possibility of social action effect, to consider technology a way of life.  ","keywords":"Artificial intelligence, Chatbots, Increased intelligence, Philosophy of technology, ChatGPT","authors":[{
	"name":"Olira Saraiva Rodrigues",
        "orcid":"0000-0003-2371-3030",
        "email":"ksr.karol@gmail.com"
        },{
	"name":"Karoline Santos Rodrigues",
        "orcid":"0000-0002-5139-9950",
        "email":"olira.rodrigues@ueg.br"
        }],"publication_date":"2023-9-1","field":"Social and Behavioral Sciences","subfield":"Education Sciences","sub_subfield":"Higher Education"}
