{"title":"Conceptualising and framing STEAM education: what is (and what is not) this educational approach?","language":"english","abstract":"STEAM is a recent educational approach intending the interdisciplinary teaching of science, technology, engineering, arts/humanities, and mathematics. The literature reports conceptual confusion that frequently diverts STEAM practice and research to issues concerning particular activities or contexts. Therefore, we carried out a narrative review of articles indexed in the Web of Science (WoS) to elucidate STEAM education’s history, epistemology, and divergences. As a strategy, we first focused on documents that could offer a panoramic view of the object of study – literature reviews and articles about STEAM frameworks. Through them, we identified essential discussion points and further expanded the review. As a result, we articulated rationalities about why STEAM is not a mere evolution of STEM, a teaching methodology, or just a synonym for interdisciplinarity. Furthermore, we discussed the appropriateness of interdisciplinarity in STEAM – since it is strongly supported by the disciplines and their intersections – instead of pursuing transdisciplinarity, meaning knowledge remains undefined in a holistic whole. We differentiated STEAM disciplines (list of the five knowledge areas), STEAM activities (interdisciplinary teaching unity of at least two STEAM disciplines), and STEAM education (educational approach of interdisciplinarity between all five disciplines). Finally, we defined and proposed a framework for STEAM in a table format that stresses two necessary and sufficient conditions – interdisciplinarity and the five acronym areas. The framework permits envisioning the plurality of teaching methodologies and educational objectives consistent with STEAM.  ","keywords":"Educational models, Integrated curriculum, Interdisciplinary approach","authors":[{
	"name":"Jefferson Rodrigues-Silva",
        "orcid":"0000-0002-8334-2107",
        "email":"jeffe.rodri@gmail.edu.br"
        },{
	"name":"Ángel Alsina",
        "orcid":"0000-0001-8506-1838",
        "email":"angel.alsina@udg.edu"
        }],"publication_date":"2023-8-2","field":"Education","subfield":"Science, Technology, Engineering, and Mathematics Education","sub_subfield":"Interdisciplinary Education"}
