{"title":"The conceptual map and the CmapTools software as neurodidactic tools to improve learning","language":"spanish","abstract":"When new concepts are developed in any scientific change and, of course, in the field of education, in many cases the idea is generated that it is something new that is going to change radically, in our case, in the way of educating and to learn. Could this be the case of Neurodidactics? It is necessary to contrast these new conceptualizations from research, as in the case of neuroscience and neurodidactics, which give the 'neuro' label to many traditionally used didactic strategies. A multitude of “neuropedagogical” models have appeared around neuroscience that aim to give the education professional powerful tools for improving learning based on advances in neuroscience. In the case of Novak's concept mapping, its effectiveness as tools for presenting expert knowledge and as promoters of meaningful learning has been demonstrated over the last few decades, allowing conceptual errors to be easily detected. Currently, this didactic efficacy has been confirmed from the research carried out with neuroscientific techniques (CAT, TOC, MRI, fNIRs, among other) that we present in this article. These investigations confirm its methodological value, which we can call neurodidactic, through the evidence of differential brain activity or level of neurocognitive effort that occurs when conceptual maps are compared with other didactic tools.  ","keywords":"Neuroscience, Neurodidactics, Conceptual maps, Concept mapping","authors":[{
	"name":"José Gijón Puerta",
        "orcid":"0000-0001-6324-1141",
        "email":"josegp@ugr.es"
        },{
	"name":"Meriem Khaled Gijón",
        "orcid":"0000-0001-9326-7422",
        "email":"meriemkg@gmail.com"
        },{
	"name":"Ana Matas Lara",
        "orcid":"0000-0001-5208-1066",
        "email":"ana.matas.lara@gmail.com"
        },{
	"name":"Pablo García Sempere",
        "orcid":"0000-0001-6329-6089",
        "email":"pgs@ugr.es"
        }],"publication_date":"2022-9-22","field":"Education","subfield":"Educational Psychology","sub_subfield":"Neurodidactics"}
