{"title":"Neuroeducation and technology: emerging partners in the teaching-learning process in the educational context of the XXI century","language":"portuguese","abstract":"Technology facilitates the lives of many people, and inserted in the educational  environment, it provides the teacher with different ways to streamline classes and make them interesting for students. Therefore, rethinking practices and the pedagogical process are routine ways of acquiring quality education. In the same way, neuroeducation and neurodidactics arise, which, as, as disciplines, increasingly strengthen teaching and learning through the understanding of how the brain works. To understand this dynamics is to offer students a more elaborate class, rethought based on a lot of reflection. Therefore, this research emerged with the general objective of analyzing neuroeducation and technology as emerging partners in the teaching-learning process in the context of the 21st century. Can neuroeducation and technology be partners in the teaching-learning process? It is the problem that drives this research. Finally, in this work, we will find the opportunity to generate reflections on the technology associated with neuroscience and its contribution to the educational process. It is up to the school, therefore, to adapt to these new moments, so there is no doubt that technology is a great resource for educational and social activities.  ","keywords":"Technology, Neuroeducation, Teaching-learning, Education","authors":[{
	"name":"Maria Selma Lima do Nascimento",
        "orcid":"0000-0003-1000-3822",
        "email":"selmalima21@yahoo.com.br"
        },{
	"name":"Leonice da Silva Santos",
        "orcid":"0000-0002-6248-339X",
        "email":"leosinha.leosinha@gmail.com"
        },{
	"name":"Maria da Penha Cardoso",
        "orcid":"0000-0001-8417-3141",
        "email":"professorapenhacardoso@hotmail.com"
        },{
	"name":"Márcia Morais de Melo",
        "orcid":"0000-0002-3948-2612",
        "email":"marciamoraismelo@hotmail.com"
        }],"publication_date":"2022-10-24","field":"Education","subfield":"Educational Technology","sub_subfield":"Educational Neuroscience"}
