{"title":"Lecturers-based evaluation on the role of technological advancements in teaching","language":"english","abstract":"The impact of technological advancements on the duties of lecturers in the twenty-first century has been significant. The rapid integration of technological advancements in the academic setting, particularly among lecturers, necessitates a proficient comprehension of the function that technology serves in the instruction of foreign languages as a fundamental component of their professional skill set. This article seeks to unveil the views of university lecturers concerning the implementation of technologically assisted instruments for the instruction of foreign languages, while also taking into account the lecturers’ perspectives regarding the application of such technologies. The analysis follows the dimension of the “TPACK” model. This model acknowledges the awareness and proficiency of linguistics lecturers in incorporating technological advancements within the educational system. The incorporation of digital tools is achieved through an expansion of the “pedagogical content knowledge (PCK)” model originally proposed by Lee Shulman. Using this model, the purpose of this research is to conduct an analysis of three significant areas (subject, pedagogy, and technology) of the use of technology in the instruction of foreign languages by lecturers. Three hundred university lecturers of foreign languages are represented in this research, and they were drawn from different universities. There was no focus on any one specific foreign language, and the lecturers’ participation consisted only of providing information in the form of questionnaire responses. According to the results of the research, a significant number of university lecturers have already embraced the use of some of these technologies in teaching foreign languages. Despite this, it is nevertheless necessary for them to get familiarized with advanced technological tools.   ","keywords":"Language Pedagogy, Lecturers, TPACK, Technology","authors":[{
	"name":"Yousef Methkal Abd Algani",
        "orcid":"0000-0003-2801-5880",
        "email":""
        },{
	"name":"Zehavit Gross",
        "orcid":"0000-0002-8758-2036",
        "email":""
        }],"publication_date":"2023-8-18","field":"Linguistics","subfield":"Language Education","sub_subfield":"Technology in Language Instruction"}
