{"title":"Automatic speech recognition and text-to-speech technologies for L2 pronunciation improvement: reflections on their affordances","language":"english","abstract":"This paper presents a reflection on two technologies - automatic speech recognition (ASR) and Text-to-Speech (TTS) - to improve learners’ pronunciation, aiming for successful spoken communication. It sheds some light on the practical usage of these technologies, demonstrating their effectiveness, qualities, and limitations to assist teachers in deciding the most efficient digital resources applied to their students’ needs. A review of literature on previous empirical studies was carried out, with quantitative and/or qualitative studies conducted by researchers in the field, investigating teachers’ and learners' perceptions and the use of ASR and TTS as a pedagogical tool for pronunciation practice. As a result, it was concluded that a) the presented resources seem to have the potential to enhance pronunciation practice, both in terms of perception and production; b) technology can result in considerable benefits to learners, mainly as a supplement to pronunciation teaching; and c) the use of these digital resources is a way of giving learners the opportunity to focus on their specific difficulties and receive personalized feedback while becoming more autonomous in their learning process.  ","keywords":"Automatic speech recognition, Text-to-speech, CALL, Pronunciation teaching, Pronunciation improvement","authors":[{
	"name":"William Gottardi",
        "orcid":"0000-0002-1291-3953",
        "email":"william.gottardi@posgrad.ufsc.br"
        },{
	"name":"Janaina Fernanda de Almeida",
        "orcid":"0000-0003-3747-0279",
        "email":"janainafernandadealmeida@gmail.com"
        },{
	"name":"Celso Henrique Soufen Tumolo",
        "orcid":"0000-0001-5045-8712",
        "email":"celsotumolo@yahoo.com.br"
        }],"publication_date":"2022-2-10","field":"Computer and Information Science","subfield":"Human-Computer Interaction","sub_subfield":"Educational Technology"}
