{"title":"Procedimento de agrupamento de alunos de acordo com o risco de evasão para melhorar a gestão estudantil no ensino superior","language":"portuguese","abstract":"O complexo problema da evasão de alunos representa uma oportunidade para a aplicação de tecnologia e métodos de mineração de dados no ensino superior. O objetivo desta pesquisa é obter o perfil dos alunos em risco de evasão e, assim, gerar planos de gestão estudantil que impactem nas variáveis que explicam essa situação. Para isso, propõe-se a utilização de uma estrutura metodológica CRISP-DM, aplicando ferramentas estatísticas e aprendizado de máquina não supervisionado. A análise transversal foi realizada em um universo de alunos do primeiro ano do turno diurno de uma universidade privada chilena. As variáveis sociodemográficas e comportamentais utilizadas foram baseadas na teoria da deserção e no julgamento de especialistas, e os dados foram obtidos nos registros históricos disponíveis na Instituição. Para obter as variáveis que mais influenciaram o abandono, foram realizadas análises de correlação e de componentes principais. A aplicação do agrupamento hierárquico aglomerativo e da técnica de conjuntos aproximados produziu quatro perfis de alunos com suas respectivas regras de associação e cinco variáveis acadêmicas que permitiram desenhar um sistema de apoio para reduzir o abandono e promover a retenção.  Evasão escolar CRISP-DM Análise de componentes principais Agrupamento hierárquico aglomerativo Conjuntos aproximados ","keywords":"","authors":[{
	"name":"Mauricio~Hinojosa",
        "orcid":"0000-0002-8962-7517",
        "email":""
        },{
	"name":"Iván~Derpich",
        "orcid":"0000-0001-9759-7285",
        "email":""
        },{
	"name":"Miguel~Alfaro",
        "orcid":"0000-0001-5891-8859",
        "email":""
        },{
	"name":"David~Ruete",
        "orcid":"0000-0002-7100-9737",
        "email":""
        },{
	"name":"Alejandro~Caroca",
        "orcid":"0000-0002-1191-687X",
        "email":""
        },{
	"name":"Gustavo~Gatica",
        "orcid":"0000-0002-1816-6856",
        "email":""
        }],"publication_date":"2022-3-2","field":"Computer Science and Information Systems","subfield":"Data Mining and Knowledge Discovery","sub_subfield":"Educational Data Mining"}
