{"title":"Effectiveness of technology interventions to promote self-regulation of learning: a meta-analysis","language":"spanish","abstract":"The benefits of incorporating technologies in education are promising. The aim of this study was to characterize the interventions developed to promote self-regulation of learning with the use of technologies and to determine their effectiveness. The method was a meta-analysis based on PRISMA standards identifying studies in Web of Science, Scopus and Eric and their subsequent analysis and selection using Rayyan software. The sample consisted of 6 studies. Data analysis was performed with Jamovi software. The results showed an insufficient characterization of the interventions regarding the number, frequency, and duration of the sessions, all of them used Zimmerman's self-regulation model, but few studies specified a technological model. The types of technologies used were LMS and mobile applications, and the instruments were self-report Likert-type scales. The meta-analysis evidenced that the interventions were effective, provided an estimate of 0.55 with a 95% confidence interval of 0.22, 0.88. The total effect size test was significant (, ). It is concluded that interventions with the use of technologies are effective in promoting self-regulation. Practical implications are presented considering these results for Higher Education.   ","keywords":"Meta-analysis, Intervention, Self-regulation of learning, Information, and communication technologies","authors":[{
	"name":"Fabiola Sáez-Delgado",
        "orcid":"0000-0002-7993-5356",
        "email":""
        },{
	"name":"Francisca Parra",
        "orcid":"0000-0002-3784-9724",
        "email":""
        },{
	"name":"Pilar Jara-Coatt",
        "orcid":"0000-0002-9975-8713",
        "email":""
        },{
	"name":"Javier Mella-Norambuena",
        "orcid":"0000-0002-4288-142X",
        "email":""
        },{
	"name":"Yaranay López-Angulo",
        "orcid":"0000-0002-3331-6875",
        "email":""
        }],"publication_date":"2023-9-4","field":"Education","subfield":"Educational Technology","sub_subfield":"Technology-enhanced Learning"}
