{"title":"Hack4women: a step in the direction of gender equality","language":"spanish","abstract":" Women who decide to study programs related to science, technology, engineering or mathematics (STEM), are significantly less than men. In the Chile of 2020, 53.9% of enrollments in higher education institutions correspond to women. However, only 20.3% are enrolled in STEM programs. The gap is due to factors that negatively impact women before entering and during their studies. Therefore, public policies are needed to help encourage more women to study STEM-related programs, along with improving their retention rate. The objective of the research is to propose solutions that contribute to gender equity. The proposal considers a quantitative, explanatory and non-experimental methodology. Through a survey of 3500 citizens, the main conditions and challenges faced by women in STEM programs were identified. Subsequently, a quantitative analysis of the results obtained was carried out, and the main causes of the conditions can be grouped into five areas of action. Finally, Hack4women is developed as a collaborative and co-creation space, where the participation of the State, companies, citizens, academia and students is highlighted. Thus, a set of 18 proposals are generated with the objective of mitigating or providing solutions to the detected areas of action that cause the demotivation of women to study STEM careers.    ","keywords":"Gender equity, Gender gap, STEM Careers, Women in STEM, Citizen survey","authors":[{
	"name":"Giannina Costa-Lizama",
        "orcid":"0000-0003-2866-2957",
        "email":"giannina.costa@unab.cl"
        },{
	"name":"Lilian San-Martin",
        "orcid":"0000-0002-6563-5838",
        "email":"lsanmartin@unab.cl"
        },{
	"name":"Oscar Pinto",
        "orcid":"0000-0002-0727-5141",
        "email":"oscarpinto@unab.cl"
        },{
	"name":"Gustavo Gatica",
        "orcid":"0000-0002-1816-6856",
        "email":"ggatica@unab.cl"
        }],"publication_date":"2022-10-18","field":"Social Sciences","subfield":"Education","sub_subfield":"Gender and Education"}
