{"title":"SEM model for technological, ecological and inclusive teacher training in times of pandemic","language":"english","abstract":"This study proposes the analysis of the relationship among teacher training (TT), teacher training in inclusive education (TTIE), teacher training in technologies (TTT), teacher training in ecology (TTE) and teacher training in times of pandemic (TTP), through a confirmatory factor analysis (CFA) with the structural equation model (SEM) of a Likert scale created ad hoc validated and confirmed. Aiming to find answers, a non-experimental, descriptive, explanatory and correlational research process was carried out. A scale was the instrument used to generate data, which has been validated in content and with an excellent Cronbach’s alpha (.902). The construct validity was carried out with an exploratory factorial analysis (EFA). The participants were 598 students of Master’s Degree in Teacher Training and the last year (4th) of the Primary Education Degree from the University of Jaen (Spain). It can be concluded that there is a relationship between the different forms of teacher training. From the correlational analysis, the highest coefficient is between teacher training in ecology and teacher training in inclusive education. From the CFA it is confirmed that this correlation is a very strong one, so that inclusion and ecology should be central axes in all teacher training; on the other hand, there seems to be a low relationship between teacher training and teacher training in times of pandemic, which shows that, at least in theory, covid-19 should not affect teacher training.   ","keywords":"Teacher training, Technology, Inclusive education, Ecology, Covid-19","authors":[{
	"name":"Antonio Hernández Fernández",
        "orcid":"0000-0002-7807-4363",
        "email":"antonio.hernandez@ujaen.es"
        },{
	"name":"Claudia de Barros Camargo",
        "orcid":"0000-0002-2286-8674",
        "email":"claudiadebarros@hotmail.es"
        }],"publication_date":"","field":"Education","subfield":"Teacher Training","sub_subfield":"Inclusive Education and Ecology"}
