{"title":"“I see they are engaged”: mediation, interaction and investment in the development of reading comprehension in English in the emergency remote teaching mode","language":"portuguese","abstract":"The results brought in the article are part of a study in which data was generated based on a narrative drawn from an interview with a language teacher, here called CINTIA. The objective of the interview was to find out how she promoted the development of reading in English in a junior high school in the private sector in the Emergency remote teaching mode, since, due to the COVID-19 pandeic, students did not have face-to-face classes. The analysis intended to reflect over the following aspects: 1) How could mediation toolsswain_sociocultural_2015 promote English reading development in remote teaching mode? 2) How can interactionellis2020, figueiredo2019 be developed in reading English classes of a junior high school in an emergency remote teaching and 3) In which aspects is it possible to perceive a Junior high learner’s investmentdarvin2016, norton2013 while developing his reading in English in the teaching remote mode? For this study, a semi-structured interview was carried out with an English teacher from a junior high school of the private sector in Porto Alegre, Rio Grande do Sul. CINTIA’s narrative suggests to show that the investment employed in this group of students  seem to be related to physical tools (computer, internet, online dictionary), as well as symbolic ones (second and mother language) of mediation used by the teacher and her learners in interactional spaces done totally in the virtual mode.  ","keywords":"Additional language reading, Emergency remote teaching, Mediation, Interaction, Investment","authors":[{
	"name":"Manuela da Silva Alencar de Souza",
        "orcid":"0000-0002-8198-1538",
        "email":"manuelasouza@ifsul.edu.br."
        },{
	"name":"Christine Siqueira Nicolaides",
        "orcid":"0000-0003-0167-3592",
        "email":"cnicolaides@unisinos.br."
        }],"publication_date":"2021-9-21","field":"Social Sciences","subfield":"Education","sub_subfield":"Language Education"}
