{"title":"How were the socio-affective skills of higher education students addressed in the pandemic?","language":"spanish","abstract":"Socio-emotional or socio-affective skills are a fundamental dimension for the comprehensive training of students, at different educational levels. COVID-19 pandemic brought to light various strengths and weaknesses of educational organizations. Even though for more than two decades many of them decided to work to develop and strengthen professional skills in their students, as a means of achieving their comprehensive training, what is demonstrable is that they have focused their training processes on the transmission of knowledge and the development of instrumental knowledge and skills, but they have neglected attention to socio-affective competencies. This article presents the results of a pilot exercise carried out with higher –level students, within classes taught in virtual environments. Through the SCAMPER technique, two ways were identified to innovate the activities that are carried out daily in classes. The first was to modify the didactic planning of the subject to formally introduce activities to develop and strengthen socio-affective skills in students, the second one consisted of opening virtual spaces in the class channel, to allow students to socialize without the presence of the teacher, who suggested certain themes as motivators for the dialogue. Twenty minutes were allocated in separate rooms of the class for the students to dialogue with each other. The results indicate that these activities benefited the students state of mind, allowing them to reflect on their emotions and reactions during the pandemic. They also allowed the teacher to identify attitudes that require specialized attention. This pilot study can be of special interest for the directors of educational organizations, for teacher and the professionals of psycho-pedagogical areas, since in a simple way it enables socialization among students and attention to their socio-emotional development.  ","keywords":"Socio-affective skills, Education in virtual environments, Health emergency for COVID-19, Teaching performance","authors":[{
	"name":"Rocío Huerta Cuervo",
        "orcid":"0000-0001-7457-8444",
        "email":"rohc0110@gmail.com"
        },{
	"name":"Marina Vicario Solórzano",
        "orcid":"0000-0003-0144-3607",
        "email":"marina.vicario@gmail.com"
        }],"publication_date":"2021-06-29","field":"Social Sciences","subfield":"Education Sciences","sub_subfield":"Educational Psychology"}
