{"title":"Are educational robots any good for communicative English learning for primary school students?","language":"english","abstract":"This paper presents a pilot study that focuses on the exploratory and rapid prototyping within the human-in-the-loop control of a self-constructed and developed educational robot in assisting communicative English learning in primary Education in Madrid, Spain. The study sample was composed of 37 3rd graders that attended four English learning program sessions in November 2021, in which robot integration plays a leading role as learning material. To achieve the above, an easy-to-build, programmed and economical LEGO Education Mindstorms EV3 package was optioned. Pre-and-post questionnaires, classroom observations, and an evaluation sheet that measures self-evaluation, peer evaluation, and teacher evaluation were applied. The result reveals students’ perception of the pioneering robot and although preliminary, presents validation of the technology for English class assistance. Another finding suggests that students’ stress generated from communication in English among peers was reduced with the companion of the robot. Due to the nature of a pilot study, both the number of sessions and the sample size are limited to determine if the robot is helpful in students’ vocabulary acquisition in the long run. Further study is to be conducted with the pioneer model to teach vocabularies of different categories for a longer period. The findings of this pilot study will serve as a reference in the attempt to develop and reproduce promising robots to assist English teaching and learning that are accessible to public schools.  ","keywords":"Robot-assisted English learning, Communicative English learning, Exploratory prototyping, Rapid prototyping","authors":[{
	"name":"Xiaotong Yu",
        "orcid":"0000-0001-6161-2498",
        "email":"xiaotong.yu01@estudiante.uam.es"
        },{
	"name":"Maria Angeles Gutierrez Garcia",
        "orcid":"0000-0001-7376-6064",
        "email":"nines.gutierrez@uam.es"
        },{
	"name":"Roberto Soto-Varela",
        "orcid":"0000-0003-2105-5580",
        "email":"roberto.soto@uva.es"
        }],"publication_date":"2023-1-2","field":"Engineering","subfield":"Robotics","sub_subfield":"Educational Robotics"}
