{"title":"A concept approach among three types of literacy: computer literacy, technological literacy and information literacy","language":"spanish","abstract":"In light of the birth of new technological tendencies and the improvement of the existing ones, concepts such as Literacy have evolved according to sociocultural needs that derive from the Information and Communication Technologies (ICT). In point of fact, these unavoidable changes generate ambiguity and polysemy of concepts to differentiate and establish where Literacy starts and where it ends. The objective of this work is to describe the concept limits and the common characteristics that exist among Technological Literacy, Computer Literacy and Information Literacy. The systematic mapping of scientific literature aids the methodological process, which identifies, describes and characterizes the dimensions of the three types of Literacy, with searches in Open Access databases —Google Scholar—, and subscription sources —ACM, EBSCO, Elsevier, Scopus and Web of Science. The results show that, while there is a difference among the types of Literacy, these types require an order in the skills and knowledge to their implementation: whereas Technological Literacy represents knowledge about hardware; Computer Literacy is equivalent to the use of software and Information Literacy is more complex, it refers to the adoption and appliance of ICT, particularly in searching for and assessing information and its ethical usage. We can conclude that the limits among the types of Literacy could be classified in consonance with the types of skills and knowledge of each individual; nonetheless, a factor of relevance that is closely related to the educational sociocultural context is identified, a factor in which Literacy is defined.  ","keywords":"Technological literacy, Computer literacy, Information literacy, Information and communication technologies, Education","authors":[{
	"name":"Julián Rodríguez López",
        "orcid":"0000-0001-5926-4519",
        "email":"rodriguez.julian@uabc.edu.mx"
        },{
	"name":"Maricela López Ornelas",
        "orcid":"0000-0002-4215-5591",
        "email":"ornelas@uabc.edu.mx"
        },{
	"name":"Katiuska Fernández Morales",
        "orcid":"0000-0002-6525-2298",
        "email":"katiuska.fernandez@uabc.edu.mx"
        },{
	"name":"Javier Organista Sandoval",
        "orcid":"0000-0001-8101-5084",
        "email":"javor@uabc.edu.mx"
        }],"publication_date":"2021-4-28","field":"Social Sciences","subfield":"Education and Educational Research","sub_subfield":"Information and Communication Technologies in Education"}
