{"title":"Language situation in Kyiv at the beginning of the 21st century: the material of a mass survey in the mobile application 'Kyiv Digital'","language":"english","abstract":"This article is devoted to the problem of analyzing the current language situation in Kyiv. The research has been carried out on the basis of the latest sociolinguistic survey in the 'Kyiv Digital' application, which was conducted in January 2023. The total number of respondents is 67,212. The linguistic behavior of Kyiv residents has been analyzed to reveal their attitudes towards language related problems to characterize their views on the use of the Ukrainian and Russian languages today and in the future. The aim of the article is to highlight the results of the analysis of the language situation in the city of Kyiv using modern digital technologies. To achieve the goal, the following research methods have been used: 1) theoretical: systematic analysis of linguistic and sociological literature; historical-genetic method; methods of mathematical statistics; 2) empirical: surveys in the 'Kyiv digital' application; observation. It has been found out that the majority of residents of the city of Kyiv have no understanding of the essence of language conflicts, and are not familiar with the legislative consolidation of those provisions related to the state language. The position of the Ukrainian language has already begun to improve after the Revolution of Dignity. Since the full-scale invasion of the aggressor, many people have been switching from Russian to Ukrainian and developing the Ukrainian cultural environment. Over the last decade, a steady increase has been observed in the number of Kyivans who consider Ukrainian their native language: from 57% in 2012 to 86% of the total number of respondents in 2022. The introduction of digital technologies to assess the linguistic situation allows to quickly analyze a significant amount of statistical data and draw conclusions about the real state of functioning of languages in society. We have singled out the following main advantages of using modern digital technologies for the analysis and assessment of the language situation: 1) the reduction of time for data collection and processing; 2) the possibility of involving a large number of participants without personal contact; 3) the potential possible to trace the dynamics of the development of the issue. However, this methodology also has its disadvantages: 1) respondents' depersonalization; 2) the inaccuracy of answers occurs when there is no contact between the interviewee and the interviewer. It has been proven that they do not significantly affect the results of the survey, which allows to recognize this technique as effective and efficient.  ","keywords":"Language situation, Language policy, Digital technologies, Bilingualism, Digitalization","authors":[{
	"name":"Mariia Boiko",
        "orcid":"0000-0001-9826-7464",
        "email":"miboiko96@gmail.com"
        },{
	"name":"Mykhailo Vintoniv",
        "orcid":"0000-0002-3258-8633",
        "email":"m.vintoniv@kubg.edu.ua"
        }],"publication_date":"2023-7-5","field":"Social Sciences","subfield":"Linguistics","sub_subfield":"Sociolinguistics"}
