{"title":"The analysis of educational interventions with video games in secondary education: a systematic review","language":"spanish","abstract":"The aim of this article is to systematize empirical information on educational video game interventions at the Secondary Education level, by describing the participants, characterization of the independent variable, effectiveness, limitations and projections of the studies. For this purpose, a systematic literature review was conducted, in which articles published in the Web of Science, Scopus and SciELO databases were analyzed, between 2016 and 2021, achieving a final sample of 19 studies. The results showed that the European continent, specifically Spain, is the place where most interventions with video games are developed at this educational level. However, the samples used were not very representative. Also, it was shown that pedagogical strategies linked to the area of Mathematics are mainly used to integrate technology into the classroom, leaving aside the promotion of the humanistic area in relation to this digital tool. Finally, all the interventions showed effectiveness; however, it is necessary to advance in this line of research, which is at an incipient level of development in schools, even more so considering the effectiveness they showed for educational purposes. In conclusion, interventions that include technologies in school contexts obtain positive results in the teaching-learning process, helping to develop both content and transversal skills in students.  ","keywords":"Information and communication technologies, Educational video games, Systematic review, Secondary education, Interventions","authors":[{
	"name":"Paula Rojas-García",
        "orcid":"0000-0001-5549-3162",
        "email":"projas@magisteredu.ucsc.cl"
        },{
	"name":"Fabiola Sáez-Delgado",
        "orcid":"0000-0002-7993-5356",
        "email":"fsaez@ucsc.cl"
        },{
	"name":"María Graciela Badilla-Quintana",
        "orcid":"0000-0002-1317-9228",
        "email":"mgbadilla@ucsc.cl"
        },{
	"name":"Laura Jiménez-Pérez",
        "orcid":"0000-0001-6697-5765",
        "email":"ljimenez@ucsc.cl"
        }],"publication_date":"2022-5-3","field":"Education","subfield":"Educational Technology","sub_subfield":"Integration of Video Games in Secondary Education"}
