{"title":"Quality education and pandemic: challenges, experiences and proposals from students in teacher training in Ecuador","language":"spanish","abstract":"The pandemic achieved what public policies, governments or academic and social initiatives could not for several decades, which was to take education and technology to a global level. This has brought many challenges to educational institutions and actors. Digital and economic gaps that seemed to be overcome or were invisible forced us to reflect on how we can contribute to this context to achieve quality education. Therefore, the objective of this research was to find out what kind of challenges, experiences and proposals students from a Higher Education Institution in Ecuador have faced in order to identify elements to improve it. For this, a mixed approach methodology was used to allow an approach to the studied phenomenon, which was done through bibliographic and documentary review, questionnaire and focus group. The results of this process are relevant to understand the scenarios that students face: limitations in connections and devices, the perception that learning is not fully realized, and the need to resort to methodologies that motivate interaction and participation in classes. But there are also proposals that must be taken into account so as to promote higher quality education: promoting mobile learning, strengthening digital skills, knowing the different realities that students face to adapt learning for them and linking initiatives from emerging learning systems theories such as connectivism.   ","keywords":"Quality education, Pandemic, Covid 19, Mobile learning, Connectivism","authors":[{
	"name":"Marielsa López",
        "orcid":"0000-0002-5297-8153",
        "email":"marielsa.lopez@unae.edu.ec"
        },{
	"name":"Mariano Herrera",
        "orcid":"0000-0002-7937-507X",
        "email":"marianoherrera@uees.edu.ec"
        },{
	"name":"Diego Apolo",
        "orcid":"0000-0002-1123-1483",
        "email":"diego.apolo@unae.edu.ec"
        }],"publication_date":"","field":"Social and Behavioral Sciences","subfield":"Education Sciences","sub_subfield":"Educational Technology"}
