{"title":"Technologies at the service of whom? A dialogue between Álvaro Vieira Pinto, Evgeny Morozov, Paulo Freire, and Sérgio Guimarães about surveillance capitalism in education","language":"portuguese","abstract":"Digital technologies are important tools to facilitate the education of millions of people in Brazil. Google and Microsoft mediate pedagogical processes through their platforms. These digital monopolies have as their main business model the monetization of their users' personal data. Through the collection, storage, organization of data and the commercialization of prediction products, the goods produced by these corporations modify the market, political strategies, ways of working, social structures and public policiescruz_neoliberalismo_2020. This phenomenon is defined as surveillance capitalism. The research aims to reflect on the advance of surveillance capitalism in education in the light of Álvaro Vieira Pinto, Evgeny Morozov, Paulo Freire and Sérgio Guimarães. It is questioned which hegemonic digital technologies present in public education are at the service of which groups? How can Álvaro Vieira Pinto, Evgeny Morozov, Paulo Freire and Sérgio Guimarães help in the reflection on surveillance capitalism in education? The work has a qualitative approach. The technique used is bibliographical research, in which the works Educar com a mídia: novos diálogos sobre educação by Paulo Freire and Sérgio Guimarães; O conceito de tecnologia by Álvaro Vieira Pinto; and Big Tech: a ascensão dos dados e a morte da política by Evgeny Morozov. It was found that the authors defend the development of critical awareness about technologies, through the analysis and understanding of the historical, economic and political contexts in which technological artifacts are developed.  ","keywords":"Surveillance capitalism, Educational platforms, Alvaro Vieira Pinto, Paulo Freire, Evgeny Morozov","authors":[{
	"name":"Janaina do Rozário Diniz",
        "orcid":"0000-0001-7993-5447",
        "email":"janaina.diniz@uemg.br"
        },{
	"name":"Renata de Souza França",
        "orcid":"0000-0002-3809-0975",
        "email":"profrenatafranca@gmail.com"
        }],"publication_date":"2023-6-14","field":"Social Sciences","subfield":"Sociology","sub_subfield":"Digital Sociology"}
