{"title":"The learning of technologies in the area of spanish language and literature: the Superpixépolis educational project","language":"spanish","abstract":"Education and Information technologies have been part of the teaching curricula due to the demands of a new digital society. In this contribution, a study has been carried out regarding the learning of technologies in the area of 'Spanish Language and Literature” during Primary Education following the Superpixel educational project by the Edelvives publishing company. A mixed methodological approach was developed: firstly, qualitative, linked to the analysis of digital contents of 16 textbooks, by expert teachers in the matter; and, secondly, quantitative, through the IBM SPSS Statistics 26.0 program, following a descriptive analysis of the following variables: course, type of digital content, book section, complexity of the activity, linguistic skills and groupings. The results have shown an important presence of digital activities in textbooks (N= 89) corresponding, mostly, to the second and third cycles of Primary Education. These activities involved searching for information online; were part of the Study Skills section (Revision or Literature); were of an intermediate level; focused on writing skills, and were designed for individual work. It is concluded that learning of technological contents from textbooks is yet to be improved since it barely focuses on neither oral skills nor collaborative learning apart from not having its own identity since it is developed mostly through study techniques, revisions, and literature.  ","keywords":"Learning, Emerging technologies, Digital contents, Textbook, Primary education, Educational project","authors":[{
	"name":"Elisabeth Melguizo Moreno",
        "orcid":"0000-0001-6964-964X",
        "email":"ely@ugr.es"
        }],"publication_date":"2021-3-17","field":"Education","subfield":"Educational Technology","sub_subfield":"Integration of Technology in Language Education"}
