{"title":"Effectiveness of flipped learning and augmented reality in the new educational normality of the Covid-19 era","language":"english","abstract":"Flipped learning and augmented reality have become two emerging didactic proposals today in the field of education. This study analyzes the effectiveness of flipped learning and augmented reality in various dimensions related to the learning process. A quasi-experimental design has been carried out in a sample of 116 students from Spain, of the third level of Secondary Education. A questionnaire has been used to collect the research data. The results show that there is a high appreciation by students of both educational experiences, although differences in various dimensions are present. Those who have received teaching based on flipped learning show significance in the teacher-student, autonomy, deepening and classtime dimensions. On the other hand, those who have developed the experience with augmented reality show significance in the dimensions of motivation, interrelation with content and students, and resolution. In conclusion, the application of an emerging methodology based on both flipped learning and augmented reality contributes positively to the optimization of learning processes in the Mathematics classroom.  ","keywords":"ICT, Flipped learning, Augmented reality, Active methodologies, Educative technology","authors":[{
	"name":"Santiago Pozo-Sánchez",
        "orcid":"0000-0001-8125-4990",
        "email":"santiagopozo@correo.ugr.es"
        },{
	"name":"Jesús Lopez-Belmonte",
        "orcid":"0000-0003-0823-3370",
        "email":"jesuslopez@ugr.es"
        },{
	"name":"Antonio José Moreno-Guerrero",
        "orcid":"0000-0003-3191-2048",
        "email":"ajmoreno@ugr.es"
        },{
	"name":"Arturo Fuentes-Cabrera",
        "orcid":"0000-0003-1970-4895",
        "email":"arturofuentes@ugr.es"
        }],"publication_date":"","field":"Education","subfield":"Educational Technology","sub_subfield":"Flipped Learning and Augmented Reality"}
