{"title":"Applications used and recommendations provided by university professors for self-regulation of learning in the context of COVID-19 pandemic","language":"spanish","abstract":"The strategic use of digital applications in higher education has been given special relevance in times of COVID-19 pandemic. This exploratory study inquires which digital applications are used and recommended by Chilean higher education lecturers in order to promote self-regulated learning on the virtual education context. The methodology was qualitative, with a phenomenographic approach, based on three focus groups, with an intentional sample of 17 lecturers. The data was analyzed through Content Analysis technique. 27 relevant digital applications were identified to facilitate self-regulation of learning, 16 useful for the preparation phase, 19 for the execution phase, 11 for the self-reflection phase, and 8 for the three phases of the Zimmerman cyclical model. WhatsApp and Google Calendar are the most recommended applications for self-regulation processes, specifically for the disposition of learning. The reciprocal influence of knowledge on self-regulation of learning and ICT skills emerges as a shared challenge to promote a strategic use of digital applications and to foster inclusive and quality learning in the university, in the context of emergency online education.  ","keywords":"Digital applications, Virtual teaching, University teaching, COVID-19","authors":[{
	"name":"Valeria Aylín Infante-Villagrán",
        "orcid":"0000-0002-1593-0468",
        "email":"valeria.a.infante.v@gmail.com"
        },{
	"name":"Bianca Maria Pia Dapelo Pellerano",
        "orcid":"0000-0001-5357-3900",
        "email":"bdapelo@uvm.cl"
        },{
	"name":"Rubia Cobo-Rendon",
        "orcid":"0000-0002-3350-071X",
        "email":"rubiacobo@udec.cl"
        },{
	"name":"Bertha Escobar-Alaniz",
        "orcid":"0000-0001-5768-1845",
        "email":"bescobar@uct.cl"
        },{
	"name":"Christian Beyle",
        "orcid":"0000-0003-2526-3141",
        "email":"cbeyle@gmail.com"
        }],"publication_date":"2021-8-30","field":"Social Sciences","subfield":"Education","sub_subfield":"Higher Education"}
