{"title":"Initial self-perception and level of digital competence of university teaching staff","language":"spanish","abstract":"Teachers in our educational context have been submerged by technological advances,  which have been causing changes in their functions, academic management and communication. As a result, they have become guides, mediators, facilitators and motivators of significant and relevant learning processes. This situation reflects the importance that teaching digital competence currently assumes.  The present article article presents a study carried out with the  professors of the University of Cádiz, whose objectives are to know the technological profile and digital competence level of  these professionals, as well as the existence of significant differences in the self-perception  of their teaching digital skills according to the branch of knowledge to which they belong. For this, an ex post facto descriptive methodology was used, which allows it to be applied once the event has already happened, using the DigCompEdu Check-in questionnaire as an instrument. Among the results obtained, the following can be highlighted: the need to provide greater relevance and institutional support to training in digital teaching competencies, the need for a greater training offer for  college professors in the face of scarce digital teaching competence and the development of digital pedagogical/teaching competences among college professor. The study  sheds light on possibility of contemplating as a training plan the creation of a training environment which based on the architecture of t-MOOC, offers, free of charge, training for university teachers.  ","keywords":"Digital competence teaching, Higher education, Teacher training, ICT","authors":[{
	"name":"Raquel Barragán Sánchez",
        "orcid":"0000-0001-6336-2728",
        "email":"rbarragan@us.es"
        },{
	"name":"Carmen Llorente Cejudo",
        "orcid":"0000-0002-4281-928X",
        "email":"karen@us.es"
        },{
	"name":"Sonia Aguilar Gavira",
        "orcid":"0000-0002-4168-271X",
        "email":"sonia.aguilar@uca.es"
        },{
	"name":"Remedios Benítez Gavira",
        "orcid":"0000-0001-6937-9221",
        "email":"r.benitez@uca.es"
        }],"publication_date":"2021-11-26","field":"Education","subfield":"Educational Technology","sub_subfield":"Digital Teaching Competencies"}
