{"title":"Marketing digital e posicionamento web na comunicação científica: estudo de um caso na disciplina da Comunicação","language":"spanish","abstract":"A Rede opera hoje como uma grande biblioteca global self-service, aberta 24x7, na qual se deve saber como se descrever para ser recuperado. Existe uma simbiose entre produção científica, perfil acadêmico ―identidade digital, personal branding― e ciência visível. Com base numa mostra de 2257 investigadores espanhóis da área da Comunicação, quanto à produção científica, visibilidade e impactos alcançados, em função da ausência ou presença ativa em perfis na Internet ―e depois de ter concluído como relevante o uso de redes acadêmicas para captar a atenção da área― agora se considera a próxima fase da investigação: estudar a influência positiva da concepção e aplicação de estratégias de marketing digital e posicionamento web ao perfil de um investigador júnior, desde o seu pré-doutoramento até agora, pós-doutorado com algumas publicações referenciadas. A partir da triangulação ―na análise quantitativa, recontando os fluxos de visitas cadastrados no ORCID, Google Scholar, Publons, ReaserchGate, Academia.edu, Exit Directory e Mendeley; na análise qualitativa, por meio de uma entrevista pessoal com o sujeito do estudo―, não apenas a hipótese é verificada ‘uma presença ativa e bem planejada na Internet melhora a visibilidade do pesquisador também no mundo analógico’, há mais resultados interessantes depois da análise web com a ferramenta SEO, SemRush.  ","keywords":"Ciência aberta, Comunicação, Identidade digital, Marketing, SEO, ICT.","authors":[{
	"name":"Sara Mandiá Rubal",
        "orcid":"0000-0003-4452-2751",
        "email":"sara.mandia.rubal@gmail.com"
        },{
	"name":"Maricela López Ornelas",
        "orcid":"0000-0002-4215-5591",
        "email":"ornelas@uabc.edu.mx"
        }],"publication_date":"2021-3-28","field":"Multidisciplinary","subfield":"Library and Information Science","sub_subfield":"Digital Libraries"}
