{"title":"Self-regulated learning of early childhood education students making oral storytelling with an app","language":"spanish","abstract":"This research analyses the level of self-regulation – based on  the autonomy and affective-emotional reaction  dimensions – of early childhood education students () doing narrative tasks supported by the story-creation app Imagistory. To do that, a mixed methodology was employed: qualitative, through the systematic observation with attention to 2 dimensions during the narrative process; and quantitative, with a non-experimental descriptive and correlational character. According to the results, it is observed that the autonomy in learning and the affective reaction increase during the narrative task supported by the app,  regardless of genre, age and tablets use. However, the extroversion and the skill level with the app are related to the increase of students’ self-regulation and affective reaction. The experiences with the app can be enriching at this educational level, as they contribute to  students’ learning self-regulation, increasing their autonomy and spontaneity to carry out narrative tasks. They also favor their communicative competence through oral expression based on illustrations and foster digital competence and visual literacy. Besides, the story supported by the app offers children the opportunity to express their emotions, empathize with the characters, and increase their interest, curiosity, security and enjoyment, as they get involved in the story.  ","keywords":"App, Digital storytelling, Early Childhood Education, Self-regulation, Oral storytelling","authors":[{
	"name":"María Esther Del-Moral Pérez",
        "orcid":"0000-0002-9143-5960",
        "email":"emoral@uniovi.es"
        },{
	"name":"Nerea López-Bouzas",
        "orcid":"0000-0003-0753-0672",
        "email":"lopeznerea@uniovi.es"
        },{
	"name":"Jonathan Castañeda Fernández",
        "orcid":"0000-0003-4934-2979",
        "email":"castanedajonathan@uniovi.es"
        },{
	"name":"María del Rosario Neira-Piñeiro",
        "orcid":"0000-0003-2355-4682",
        "email":"neiramaria@uniovi.es"
        }],"publication_date":"2022-5-17","field":"Education Sciences","subfield":"Early Childhood Education","sub_subfield":"Self-regulation in Early Childhood Education"}
