{"title":"Use of internet and social networks within the framework of the Covid-19 situation in Colombia: analysis of young people considering their socio-economic level","language":"spanish","abstract":"The socio-economic condition of households in Colombia is a factor that affects internet access. During the Covid-19 health contingency in Colombia there has been evidence of a technological gap in favor of  higher social classes in relation to low and middle-income segments. The use of the Internet became an essential  for everyone to work and and interact during the periods of confinement derived from the pandemic. Consequently, the devices used to connect to the internet has made it possible to observe the way in which each population segment connects to the network according to their financial position. The purpose of this study was to identify the devices used by young people living in Colombia to access the internet during the Covid-19 health contingency, considering their socio-economic condition.  Possible diferences in frequency and time of social media, radio and TV use were also examined (through the internet). Online questionnaires (household surveys) were applied to young people – first to 1.419 participants, then to 810 individuals. It was found that the socio-economic factor does affect the consumption of the internet and social networks among the Colombian youth population, and that there are significant variations  regarding the use of the various social networks, considering social stratification. Television consumption exceeds listening to the radio. According to the results, there is evidence that each population segment has its own preferences regarding the use of devices and social networks.  ","keywords":"Internet, Digital divide, Social media, Electronic media","authors":[{
	"name":"Guillermo Rodríguez-Martínez",
        "orcid":"0000-0003-4329-5745",
        "email":""
        },{
	"name":"Carlos Andrés Arango Lozano",
        "orcid":"0000-0002-2786-3653",
        "email":""
        }],"publication_date":"2021-11-4","field":"Social Sciences","subfield":"Economics","sub_subfield":"Economic Development"}
