{"title":"Productivity analysis around information literacy in the higher education stage}","language":"spanish","abstract":"Today, the amount of information coming from the digital network has proliferated exponentially, due to the advent of information and communication technologies (ICT). As a result, the need to promote training in information competences is an educational challenge in the face of current disinformation phenomena such as fake news. Therefore, this paper analyses the evolution of information literacy productivity in higher education from an international context. For this purpose, different bibliometric indicators were used to systematize the information from the Web of Sciences and Scopus databases. The results showed that information literacy productivity is in a growth phase, with different authors and institutions from different parts of the world publishing on this topic. The study showed that the main line of publication turns towards the analysis of perceptions of this competence in university students and the study of the immersion of this compendium of skills in the curricular plans, as well as the configuration of instruments of a different nature that allows analyzing exactly this set of skills. Such results, therefore, suggest the need for keeping the inclusion of this skill set in the globality of higher education disciplines.  ","keywords":"Information literacy, ICT, Information competence, Higher education, Bibliometrics","authors":[{
	"name":"Gerardo Gómez García",
        "orcid":"0000-0002-1123-5572",
        "email":"gomezgarcia@ugr.es"
        },{
	"name":"Francisco Javier Hinojo Lucena~",
        "orcid":"0000-0002-9507-4058",
        "email":"fhinojo@ugr.es"
        },{
	"name":"Inmaculada Aznar Díaz~",
        "orcid":"0000-0002-0018-1150",
        "email":"iaznar@ugr.es"
        },{
	"name":"José María Romero Rodríguez~",
        "orcid":"0000-0002-9284-8919",
        "email":"romejo@ugr.es"
        }],"publication_date":"","field":"Social and Behavioral Sciences","subfield":"Education","sub_subfield":"Educational Technology and E-Learning"}
