{"title":"Trends in the state-of-the-art mobile audiovisual narratives in the 21st century: systematic review of the literature","language":"spanish","abstract":"Research on mobile audiovisual narratives as fiction products has had an irregular presence in the scientific literature of the 21st century. The rapid expansion of mobile devices has fostered their possibilities, with the initial appearance of specific series for this medium, the so-called movie series. In this work, a systematic analysis of the literature has been carried out (2000-2018) from the main databases, WOS, Scopus and Google Scholar, using a selection of keywords that define the object of study: movie series, new narratives, storytelling and television series. From the initial corpus of 750 references, 36 research papersworks corresponding to Social Sciences, and specifically to the Communication category, were filtered out. The results show, first of all, the different approaches of the studies. On one hand, there are descriptive studies about narrative structures, their origin and evolution (predominant approach). On the other hand, there are studies carried out in the educational field which focus on the user's perception and consumption habits. Finally, there are studies carried out from the technological perspective. Secondly, results are drawn from the methodologies used. In this respect, qualitative studies and case studies stand out. Thirdly, conclusions are drawn on state-of-the-art in different countries. It is possible to conclude, therefore, that internationalization is a dominant pattern, although articles by authors from universities in the same country are more numerous than international collaborations.   ","keywords":"Trends, Narratives, Audiovisual, Mobile devices, Systematic review","authors":[{
	"name":"Valeriano Durán Manso",
        "orcid":"0000-0001-9188-6166",
        "email":"valerioduran@us.es"
        },{
	"name":"María-Victoria Carrillo-Durán",
        "orcid":"0000-0002-1256-8870",
        "email":"vicduran@unex.es"
        },{
	"name":"Javier Trabadela-Robles",
        "orcid":"0000-0001-5338-9257",
        "email":"jtrarob@unex.es"
        }],"publication_date":"2021-7-23","field":"Social Sciences","subfield":"Communication","sub_subfield":"Media Studies"}
